kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Host-Touch-V_4_9_0/ESP32-S3-Host-Touch-V_4_9_0.ino
/**
 * ============================================================================
 * โครงการวิจัย: ผลของการใช้นวัตกรรม Smart IV Alert ต่อความแม่นยำในการแจ้งเตือนและปริมาณสารน้ำที่ได้รับ
 * หน่วยงาน: หอผู้ป่วยอายุรกรรม โรงพยาบาลสูงเม่น จังหวัดแพร่
 * สถาบัน: วิทยาลัยพยาบาลบรมราชชนนี แพร่ คณะพยาบาลศาสตร์ สถาบันพระบรมราชชนก
 *
 * ระบบ: Central Host Gateway (เครื่องควบคุมและติดตามศูนย์กลาง)
 * เวอร์ชัน: 4.9.0-TOUCH (Protocol v3 — ใช้คู่กับ Bed Station Firmware 7.4.x / 7.5.x)
 * บอร์ดประมวลผล: ESP32-S3 Dev Module (N16R8) + จอสัมผัส 2.4" (ST7789V/ILI9341 240x320 + XPT2046)
 *                 + SD card (ช่องบนหลังจอ) + นาฬิกา DS3231 + Passive Buzzer + ปุ่ม multifunction
 *
 * ผู้พัฒนาระบบ: นายกิตติพันธ์ รัตนคร (นักวิชาการคอมพิวเตอร์ มจร. วิทยาเขตแพร่)
 * อาจารย์ที่ปรึกษา: ดร.กรรณิการ์ กาศสมบูรณ์ (วิทยาลัยพยาบาลบรมราชชนนี แพร่)
 *
 * ---------------------------------------------------------------------------
 * เพิ่มใน V4.9.1: นาฬิกาสำรอง DS3231 และการบันทึกข้อมูลลง SD card
 *  - DS3231 (I2C) เก็บวันที่-เวลาไว้แม้ไฟดับ อ่านค่ามาตั้งเวลาระบบตอนบูตทันที
 *    และเมื่อเปิดหน้าเว็บจากมือถือ เวลาของเครื่องนั้นจะถูกเขียนลง DS3231 ให้ด้วย
 *    (เก็บเป็น UTC แล้วแปลงเป็นเวลาไทยตอนแสดงผล) ถ้าไม่มีโมดูลก็ยังใช้งานได้เหมือนเดิม
 *  - บันทึกข้อมูลรายนาทีของทุกเตียงลง SD card เป็นไฟล์ CSV วันละไฟล์
 *    พร้อมไฟล์บันทึกเหตุการณ์ (เกิดเหตุเตือน เริ่มถุงใหม่ แก้ค่า ตั้งเวลา) แยกอีกไฟล์
 *    ดาวน์โหลดไฟล์จากหน้าเว็บได้ และดูสถานะการ์ดได้จากหน้าตั้งค่าบนจอ
 *  - ถอด/ใส่การ์ดกลางคันได้ ระบบจะลองต่อการ์ดใหม่ให้เองทุก 30 วินาที
 *
 * เปลี่ยนใน V4.9.0-TOUCH: ใช้จอสัมผัส 2.4" และทำหน้าจอให้ใช้งานเหมือนสมาร์ตโฟน
 *  - จอแนวตั้ง 240x320 พร้อมทัชสกรีนแบบความต้านทาน (XPT2046) ใช้ร่วมบัส SPI เดียวกับจอ
 *  - หน้าหลักแบบ FOCUS: เตียงที่ต้องดูตอนนี้ตัวใหญ่ + รายการเตียงอื่น แตะที่ใดก็เข้าดูเตียงนั้นได้
 *  - แตะเข้าไปในเตียงเพื่อสั่งงาน: เริ่มถุงใหม่ / รับทราบเตือนใกล้หมด / ตั้งค่าของเตียง
 *  - ตั้งค่าได้บนจอโดยตรง: อัตราเป้าหมาย ปริมาตรตามแผน Drop factor % เตือนใกล้หมด
 *    จำนวนเตียงที่ใช้งาน และความสว่างหน้าจอ (ปรับด้วยปุ่ม - + หรือแป้นตัวเลขบนจอ)
 *    ทุกค่ายังแก้จากหน้าเว็บได้เหมือนเดิม และบันทึกลง NVS ชุดเดียวกัน
 *  - มีหน้าปรับความแม่นของจอสัมผัส (Calibration) เก็บค่าไว้ใน NVS
 *  - ปุ่ม multifunction 1 ปุ่ม: คลิก = ย้อนกลับ/พักเสียง, ดับเบิลคลิก = ปิด/เปิดจอ,
 *    กดค้าง 2 วินาที = ปิดเครื่อง
 *  - หรี่จออัตโนมัติเมื่อไม่มีการใช้งาน 3 นาที แตะหน้าจอเพื่อกลับมาสว่าง
 *  - ตรรกะการวัด การแจ้งเตือน ESP-NOW และหน้าเว็บทั้งหมดเหมือน V4.8.0 ทุกประการ
 *
 * ---------------------------------------------------------------------------
 * เปลี่ยนใน V4.8.0-TFT: เปลี่ยนจอ OLED 1.3" ขาวดำ -> จอสี TFT 2.8" (ST7789V 240x320)
 *  - ใช้จอแนวนอน 320x240 ออกแบบหน้าจอใหม่แนวทาง "FOCUS"
 *    ครึ่งซ้าย = เตียงที่ต้องดูตอนนี้ (ตัวเลขใหญ่ อ่านได้จากระยะไกล)
 *    ครึ่งขวา  = รายการเตียงอื่นพร้อมอัตราไหลและแถบความคืบหน้า (ปรับขนาดแถวตามจำนวนเตียง)
 *    แถบล่าง   = สรุปเหตุการณ์ที่ต้องทำตอนนี้
 *  - เตียงที่ถูกเน้นเลือกอัตโนมัติ: เหตุวิกฤตมาก่อน ตามด้วยใกล้หมดถุง
 *    กดปุ่ม PAGE เพื่อเลื่อนดูเตียงอื่นเองได้ (กลับเป็นอัตโนมัติเมื่อมีเหตุใหม่)
 *  - มีจอเตือนเต็มจอสีแดงเมื่อเกิดเหตุวิกฤตและยังไม่พักเสียง
 *  - ตัดไลบรารี U8g2 ออก ใช้ Adafruit GFX + ST7789 แทน (เฟิร์มแวร์นี้รองรับจอ TFT อย่างเดียว)
 *  - ตรรกะการวัด การแจ้งเตือน ESP-NOW และหน้าเว็บทั้งหมดเหมือน V4.7.0 ทุกประการ
 *
 * ---------------------------------------------------------------------------
 * เปลี่ยนใน V4.7.0: ตัดระบบจัดการ Wi-Fi (Router/อินเทอร์เน็ต) ออกทั้งหมด
 *  - Host ทำงานเป็น Access Point อย่างเดียว (WIFI_AP) ไม่ต่อ Router ไม่ใช้ NTP
 *    -> ไม่มีการสแกนช่อง/รีคอนเนกต์มาแย่งเวลาคลื่นวิทยุ ESP-NOW และ Web Server อีก
 *  - รองรับสมาร์ตโฟน/แท็บเล็ตพร้อมกันได้ถึง AP_MAX_CLIENTS เครื่อง (เดิมค่าปริยาย 4
 *    และในโหมด AP+STA เหลือใช้งานจริงเพียง 2-3 เครื่อง)
 *  - ปิดโหมดประหยัดพลังงานของ Wi-Fi (WIFI_PS_NONE) ให้ตอบสนองหลายเครื่องพร้อมกันได้นิ่ง
 *  - ESP-NOW ส่งผ่านอินเทอร์เฟซ AP (WIFI_IF_AP) เพราะไม่มี STA แล้ว
 *  - ตั้งเวลาจากนาฬิกาของเครื่องที่เปิดหน้าเว็บโดยอัตโนมัติ (แทน NTP) และสำรองเวลาไว้ใน NVS
 *    ทุก 10 นาที เพื่อให้เวลาไม่หายเมื่อไฟดับ (แสดงเป็น "เวลาโดยประมาณ" จนกว่าจะซิงก์ใหม่)
 *  - หน้าเว็บ: เอาเมนูจัดการ Wi-Fi ออก เหลือหน้าต่างแสดงข้อมูลจุดเชื่อมต่อแบบอ่านอย่างเดียว
 *    และหยุด Poll ข้อมูลเมื่อสลับแท็บไปทำอย่างอื่น (ลดภาระเมื่อมีผู้ใช้หลายเครื่อง)
 *
 * ---------------------------------------------------------------------------
 * เพิ่มใน V4.6.0: แจ้งเตือนใกล้หมด (เตรียมถุงใหม่)
 *  - ตั้ง % ต่อเตียงจากหน้าเว็บ (50-95%, ค่าเริ่มต้น 80%) เก็บถาวรใน NVS
 *  - Host เสียงเตือนเบา 3 ครั้ง ซ้ำทุก 5 นาทีจนกว่าจะรับทราบ (ที่เตียง / ปุ่ม POWER / หน้าเว็บ)
 *  - รับทราบแล้วซิงก์ไปทุกจุด และล้างเมื่อกด "เริ่มถุงใหม่" หรือแก้ปริมาตร/เปอร์เซ็นต์
 *
 * สรุปการแก้ไขจาก V4.4.1 (โค้ดภายในระบุ 6.3.2)
 *  1) แก้จุดที่คอมไพล์ไม่ผ่าน (ฟิลด์ใน StationData / ชื่อฟังก์ชัน-ตัวแปรใน loop)
 *  2) โครงสร้างแพ็กเก็ต ESP-NOW ตรงกับ Station ทุกไบต์ (มี static_assert ตรวจขนาด)
 *  3) Station ส่งอัตราไหลที่คำนวณจากช่วงห่างระหว่างหยด + เวลาตั้งแต่หยดล่าสุด
 *     -> เลิกคำนวณ rate จากหน้าต่าง 2 วินาทีที่ทำให้แจ้งเตือนสายพับผิด
 *  4) Host เป็นผู้ตัดสินรหัสเตือนจุดเดียว เรียก evaluateClinicalAlerts() ทุก 1 วินาที
 *  5) ส่ง Sync ทุก 1 วินาที (เดิม 10 วินาที ขณะที่ Station ตัดสินว่าหลุดที่ 5 วินาที)
 *  6) เพิ่ม API /api/stations/config และ /api/stations/reset
 *     ค่า Target Rate / Plan Volume / Drop Factor / ชื่อผู้ป่วย เก็บที่ Host (NVS)
 *  7) Drop factor ใช้ค่าของแต่ละเตียง (10/15/20/60) แทนค่าคงที่ 20
 *  8) นับหยดรายนาทีจากผลต่าง totalDrops -> แพ็กเก็ตหายไม่ทำให้ข้อมูลหาย
 *  9) SoftAP ล็อก Channel 1
 * 10) Deep sleep ใช้ ext0 wakeup (esp_deep_sleep_enable_gpio_wakeup ไม่รองรับ ESP32-S3)
 * 11) ปุ่ม POWER กดสั้นขณะมีเสียงเตือน = พักเสียง 2 นาที (Snooze)
 * ============================================================================
 */

#include <WiFi.h>
#include <esp_now.h>
#include <esp_wifi.h>
#include <WebServer.h>
#include <Preferences.h>
#include <ESPmDNS.h>
#include <Adafruit_GFX.h>
#include <Adafruit_ST7789.h>
#include <XPT2046_Touchscreen.h>
#include <SPI.h>
#include <Wire.h>
#include <RTClib.h>
#include <FS.h>
#include <SD.h>
#include <time.h>
#include <sys/time.h>
#include <driver/rtc_io.h>

#define APP_VERSION         "4.9.1-TOUCH"
#define DEV_NAME            "กิตติพันธ์ รัตนคร"
#define DEV_ROLE            "นักวิชาการคอมพิวเตอร์"
#define DEV_INSTITUTION     "มหาวิทยาลัยมหาจุฬาลงกรณราชวิทยาลัย วิทยาเขตแพร่"

// ----------------------------------------------------------------------------
// กำหนดขาเชื่อมต่อฮาร์ดแวร์ฝั่ง Host
// ----------------------------------------------------------------------------
#define HOST_BAT_ADC_PIN    1   // ขาอ่านแบตเตอรี่ Host
#define POWER_BTN_PIN       4   // ปุ่มเปิด-ปิดหน้าจอ / พักเสียงเตือน (Snooze) — ต้องเป็น RTC GPIO (0-21)
// เวอร์ชันนี้ใช้ปุ่มเดียว (POWER_BTN_PIN) ทำงานหลายหน้าที่ — ขา 5 จึงว่างไว้เผื่ออนาคต
#define BUZZER_PIN          7   // ขาต่อลำโพง Passive Buzzer

