kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Host-Touch-V_4_9_0/ESP32-S3-Host-Touch-V_4_9_0.ino
// ---- จอสัมผัส 2.4" (จอ 14 ขา + ทัช 4-5 ขา ใช้บัส SPI ร่วมกัน) ----
// ต่อสายจอ : VCC->3V3, GND->GND, SCL/SCK->TFT_SCLK, SDA/MOSI->TFT_MOSI,
//            RES->TFT_RST, DC->TFT_DC, CS->TFT_CS, BLK->TFT_BLK
// ต่อสายทัช: T_CLK->TFT_SCLK (ร่วมกัน), T_DIN->TFT_MOSI (ร่วมกัน),
//            T_DO->TFT_MISO, T_CS->TOUCH_CS_PIN, T_IRQ->TOUCH_IRQ_PIN (ต่อหรือไม่ต่อก็ได้)
// หมายเหตุ: บอร์ด N16R8 ใช้ GPIO33-37 กับ PSRAM ห้ามนำมาใช้
#define TFT_CS              10
#define TFT_DC              9
#define TFT_RST             8
#define TFT_MOSI            11
#define TFT_SCLK            12
#define TFT_MISO            16  // จำเป็นสำหรับอ่านค่าจากทัช (จอไม่ได้ใช้)
#define TFT_BLK             13  // -1 = ไม่ได้ต่อขาควบคุมไฟหน้าจอ
#define TFT_ROTATION        0   // 0 = แนวตั้ง 240x320 (ถ้าภาพกลับหัวให้ใช้ 2)

#define TOUCH_CS_PIN        14
#define TOUCH_IRQ_PIN       15  // ตั้งเป็น 255 ถ้าไม่ได้ต่อขา T_IRQ
#define TOUCH_MIN_PRESSURE  200 // แรงกดต่ำสุดที่ถือว่าเป็นการแตะจริง

// ปรับทิศทางของทัชให้ตรงกับภาพบนจอ (ถ้าแตะแล้วตำแหน่งสลับแกนหรือกลับด้าน ให้แก้ 3 ค่านี้)
#define TOUCH_SWAP_XY       0
#define TOUCH_FLIP_X        0
#define TOUCH_FLIP_Y        0

#define BACKLIGHT_DIM_MS    180000  // ไม่มีการใช้งาน 3 นาที -> หรี่จอ
#define BACKLIGHT_DIM_PCT   20

// ---- SD card บนหลังจอ (ใช้บัส SPI ร่วมกับจอและทัช ต่างกันที่ขา CS) ----
#define SD_CS_PIN           21
#define SD_SPI_HZ           20000000

// ---- นาฬิกาสำรอง DS3231 (I2C) ----
#define RTC_SDA_PIN         5
#define RTC_SCL_PIN         6

// ----------------------------------------------------------------------------
// ค่าคงที่ของระบบสื่อสารและการแจ้งเตือน (ต้องตรงกับ Station)
// ----------------------------------------------------------------------------
#define ESPNOW_CHANNEL          1        // ช่อง SoftAP / ESP-NOW เริ่มต้น
#define SYNC_INTERVAL_MS        1000     // ส่ง Sync ให้ Station ทุก 1 วินาที
#define ONLINE_TIMEOUT_MS       5000     // ไม่ได้รับข้อมูลเกิน 5 วินาที = OFFLINE
#define MIN_OCCLUSION_MS        8000     // เวลาต่ำสุดที่ไม่มีหยดก่อนถือว่าหยุดไหล
#define MAX_OCCLUSION_MS        300000   // เพดานเวลาตัดสินหยุดไหล (อัตราต่ำมาก)
#define RATE_DEVIATION_HOLD_MS  20000    // เร็ว/ช้าเกินต่อเนื่อง 20 วินาทีจึงเตือน
#define SNOOZE_MS               120000   // พักเสียง 2 นาที
#define NEAR_END_REMIND_MS      300000   // เตือนใกล้หมดซ้ำทุก 5 นาทีจนกว่าจะรับทราบ
#define SCREENSAVER_IDLE_MS     300000   // ไม่มีการกดปุ่ม 5 นาที -> เข้าโหมดนาฬิกา
#define MANUAL_FOCUS_HOLD_MS    60000    // เลือกเตียงเองแล้วคงไว้ 1 นาที ก่อนกลับเป็นอัตโนมัติ
#define DEFAULT_NEAR_END_PCT    80       // เตือนเมื่อให้ไปแล้ว 80% ของปริมาตรตามแผน
#define AP_MAX_CLIENTS          8        // จำนวนสมาร์ตโฟน/แท็บเล็ตที่ต่อพร้อมกันได้ (สูงสุด 10)
#define TIME_BACKUP_INTERVAL_MS 600000   // สำรองเวลาปัจจุบันลง NVS ทุก 10 นาที

// รหัสแจ้งเตือน (ใช้ร่วมกันทั้ง Host / Station / Web)
#define ALERT_NONE        0
#define ALERT_TOO_FAST    1
#define ALERT_TOO_SLOW    2
#define ALERT_NEAR_END    3   // ให้ไปแล้วถึง % ที่ตั้ง (เตือนเบา ไม่ใช่เหตุวิกฤต)
#define ALERT_COMPLETE    4   // ให้ครบตามแผนแล้ว
#define ALERT_OCCLUSION   5   // สายพับ / หยุดไหล

SPIClass SPI_TFT(FSPI);
Adafruit_ST7789 tft = Adafruit_ST7789(&SPI_TFT, TFT_CS, TFT_DC, TFT_RST);

const char *default_ap_ssid = "ESP32_Liquid_Monitor";
const char *default_ap_pass = "12345678";
const char *web_username    = "admin";
const char *web_password    = "password123";

// เขตเวลาไทย (ICT UTC+7) — ตั้งค่าในตัวเครื่อง ไม่พึ่ง NTP อีกต่อไป
const char* TZ_THAILAND     = "ICT-7";

#define MAX_SUPPORTED_STATIONS 8
#define MAX_LOGS 60

WebServer server(80);
Preferences preferences;
portMUX_TYPE dataMux = portMUX_INITIALIZER_UNLOCKED;

uint8_t activeStationCount  = 5;
int  manualFocusBed         = -1;      // เตียงที่ผู้ใช้เลือกดูเอง (-1 = อัตโนมัติ)
unsigned long manualFocusUntil = 0;
bool displaySleeping        = false;
bool isPowerOffProgressActive = false;

// ---- สถานะของแอปบนจอสัมผัส (ไฟล์ .ino สร้าง prototype ให้เฉพาะฟังก์ชัน ตัวแปรจึงต้องประกาศไว้ก่อน) ----
enum UiScreen {
  SCR_HOME = 0,   // หน้าหลักแบบ FOCUS
  SCR_BED,        // รายละเอียดเตียง
  SCR_BED_SET,    // ตั้งค่าของเตียง
  SCR_NUMPAD,     // แป้นตัวเลข
  SCR_SYS,        // ตั้งค่าระบบ
  SCR_ALARM,      // จอเตือนเต็มจอ
  SCR_CALIB,      // ปรับความแม่นจอสัมผัส
  SCR_POWER       // หน้าจอปิดเครื่อง
};

UiScreen uiScreen       = SCR_HOME;
UiScreen uiScreenDrawn  = (UiScreen)-1;
int  uiSelectedBed      = 0;       // เตียงที่กำลังเปิดดู (0-based)
int  uiEditField        = 0;       // ช่องที่กำลังแก้ค่า
bool uiNeedFramework    = true;    // ต้องวาดกรอบใหม่ทั้งหน้า
uint8_t screenBrightness = 100;    // ความสว่างหน้าจอ 25-100 %
bool backlightDimmed    = false;

unsigned long lastUserActivityTime = 0;
bool isTimeSynced           = false;   // ตั้งเวลาจากเครื่องผู้ใช้ผ่านหน้าเว็บแล้ว
bool isTimeApprox           = false;   // กู้เวลาจากที่สำรองไว้ตอนบูต (ยังไม่ซิงก์ใหม่)
unsigned long lastTimeBackup = 0;

uint8_t broadcastAddress[] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};

// ----------------------------------------------------------------------------
// โครงสร้างข้อมูลรับ-ส่ง ESP-NOW (Protocol v2) — ต้องเหมือนกับ Station ทุกไบต์
// ----------------------------------------------------------------------------
typedef struct __attribute__((packed)) struct_message {
  uint8_t  stationId;
  uint8_t  isRunning;
  uint32_t totalDrops;
  uint32_t periodDrops;
  float    flowRateHr;       // อัตราไหลที่ Station คำนวณจากช่วงห่างระหว่างหยด (mL/h)
  uint32_t msSinceLastDrop;  // มิลลิวินาทีนับจากหยดล่าสุด (0 = ยังไม่มีหยด)
  float    batteryVolts;     // 0 = ไม่มีวงจรวัดแบตเตอรี่
  uint8_t  flags;            // bit0 = พยาบาลกดรับทราบเตือนใกล้หมดที่เตียง
} struct_message;            // 23 bytes

typedef struct __attribute__((packed)) struct_host_sync {
  uint32_t epochTime;
  uint8_t  isSynced;
  uint8_t  stationId;
  float    targetRateHr;
  float    totalPlanMl;
  uint8_t  alertCode;
  uint8_t  dropFactor;
  uint8_t  resetSeq;         // เปลี่ยนค่าเมื่อกด "เริ่มถุงใหม่" -> Station รีเซ็ตตัวนับ
  uint8_t  hostChannel;
  uint8_t  nearEndPct;       // % ของปริมาตรตามแผนที่เริ่มเตือนใกล้หมด
  uint8_t  flags;            // bit0 = รับทราบเตือนใกล้หมดแล้ว
} struct_host_sync;          // 20 bytes

