kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Host-Touch-V_4_9_0/ESP32-S3-Host-Touch-V_4_9_0.ino
static_assert(sizeof(struct_message) == 23, "struct_message must be 23 bytes (match Station)");
static_assert(sizeof(struct_host_sync) == 20, "struct_host_sync must be 20 bytes (match Station)");

struct LogEntry {
  uint32_t minuteIndex;
  char timeStr[20];
  uint16_t drops;
  float volume;
  float rateHr;
  float targetRate;
  uint8_t alertCode;
  int8_t rssi;
  float battery;
};

struct BedConfig {
  float   targetRateHr = 0.0f;
  float   planVolumeMl = 0.0f;
  uint8_t dropFactor   = 20;
  uint8_t resetSeq     = 0;
  char    patientName[64] = "";
};

struct TrialCaseRecord {
  bool active = false;
  uint8_t caseNumber = 1;
  char startTimeStr[24] = "";
  float targetRate = 0.0;
  float planVolume = 0.0;
  float actualVolume = 0.0;
  float errorMl = 0.0;
  float errorPercent = 0.0;
};

struct StationData {
  bool active = false;
  bool isRunning = true;
  int8_t rssi = -100;
  float batteryVolts = 0.0;
  uint32_t totalDrops = 0;
  uint32_t lastTotalDrops = 0;
  bool hasBaseline = false;
  uint32_t dropsInCurrentMinute = 0;
  float totalVolumeMl = 0.0;
  float flowRate_ml_hr = 0.0;
  uint32_t msSinceLastDrop = 0;
  unsigned long lastRecvTime = 0;
  uint8_t alertCode = ALERT_NONE;
  unsigned long deviationSince = 0;
  uint8_t nearEndPct = DEFAULT_NEAR_END_PCT;   // เก็บแยก key ใน NVS เพื่อไม่ให้ค่าตั้งเดิมหาย
  bool nearEndAck = false;
  unsigned long nearNextChime = 0;

  BedConfig cfg;
  TrialCaseRecord trialCase;
  LogEntry logs[MAX_LOGS];
  uint8_t logCount = 0;
};

StationData stations[MAX_SUPPORTED_STATIONS];
unsigned long lastCalcTime           = 0;
unsigned long lastMinuteLogTime      = 0;
unsigned long lastOledUpdateTime     = 0;
unsigned long lastSyncBroadcastTime  = 0;
unsigned long globalSnoozeUntil      = 0;
uint32_t globalMinuteCounter         = 0;

float hostBatteryVolts = 4.2;
int hostBatteryPct = 100;

bool globalAlarmTriggered            = false;
unsigned long lastBuzzerAlarmTime    = 0;
uint8_t nearChimeRemaining           = 0;
unsigned long nearChimeNextBeep      = 0;

void updateHostDisplay();
void setDisplaySleep(bool sleep);
void setBacklightRaw(int pct);
void setScreenBrightness(int pct);
int  currentFocusBed();
void uiGoBack();
void serviceTouch();
void drawPowerOffProgress(int pct);
void drawGoodbyeScreen();
void drawSettingRow(int y, const char* label, const String &value, const char* unit, bool force);
void stepEditedValue(int field, int dir);
void openNumpad(int field);

// ----------------------------------------------------------------------------
// ฟังก์ชันช่วย
// ----------------------------------------------------------------------------
uint8_t safeDropFactor(uint8_t df) {
  return (df == 10 || df == 15 || df == 20 || df == 60) ? df : 20;
}

bool isCriticalAlert(uint8_t code) {
  return code == ALERT_TOO_FAST || code == ALERT_TOO_SLOW ||
         code == ALERT_COMPLETE || code == ALERT_OCCLUSION;
}

uint8_t safeNearPct(uint8_t p) {
  return (p >= 50 && p <= 95) ? p : DEFAULT_NEAR_END_PCT;
}

bool isSnoozed() {
  return globalSnoozeUntil > 0 && millis() < globalSnoozeUntil;
}

bool isStationOnline(int i) {
  unsigned long lr = stations[i].lastRecvTime;
  if (lr == 0) return false;
  unsigned long now = millis();
  return (now < lr) || (now - lr < ONLINE_TIMEOUT_MS);
}

// เกณฑ์เวลา "ไม่มีหยด" = 2.5 เท่าของช่วงหยดตามเป้าหมาย (ขั้นต่ำ 8 วินาที) — สูตรเดียวกับ Station
uint32_t occlusionThresholdMs(float rateHr, uint8_t df) {
  if (rateHr <= 0.0f) return MIN_OCCLUSION_MS;
  float dropsPerHr = rateHr * (float)df;
  uint32_t expected = (uint32_t)(3600000.0f / dropsPerHr);
  uint32_t th = (expected * 5) / 2;
  if (th < MIN_OCCLUSION_MS) th = MIN_OCCLUSION_MS;
  if (th > MAX_OCCLUSION_MS) th = MAX_OCCLUSION_MS;
  return th;
}

bool isStationOccluded(int i) {
  const StationData &s = stations[i];
  if (!isStationOnline(i) || !s.isRunning || s.totalDrops == 0 || s.msSinceLastDrop == 0) return false;
  unsigned long age = millis() - s.lastRecvTime;
  uint32_t since = s.msSinceLastDrop + (uint32_t)age;
  return since > occlusionThresholdMs(s.cfg.targetRateHr, safeDropFactor(s.cfg.dropFactor));
}

const char* alertTextEn(uint8_t code) {
  switch (code) {
    case ALERT_TOO_FAST:  return "TOO FAST";
    case ALERT_TOO_SLOW:  return "TOO SLOW";
    case ALERT_NEAR_END:  return "NEXT BAG";
    case ALERT_COMPLETE:  return "BAG EMPTY";
    case ALERT_OCCLUSION: return "OCCLUSION";
    default:              return "NORMAL";
  }
}

String jsonEscape(const char* s) {
  String o;
  for (const char* p = s; *p; p++) {
    char c = *p;
    if (c == '"' || c == '\\') { o += '\\'; o += c; }
    else if ((uint8_t)c < 0x20) o += ' ';
    else o += c;
  }
  return o;
}

uint8_t currentWifiChannel() {
  uint8_t primary = 0;
  wifi_second_chan_t second;
  esp_wifi_get_channel(&primary, &second);
  return primary;
}

// ----------------------------------------------------------------------------
// ค่าตั้งเตียง (เก็บถาวรใน NVS)
// ----------------------------------------------------------------------------
void loadBedConfigs() {
  preferences.begin("bed-cfg", true);
  for (int i = 0; i < MAX_SUPPORTED_STATIONS; i++) {
    char key[6];
    snprintf(key, sizeof(key), "b%d", i + 1);
    if (preferences.getBytesLength(key) == sizeof(BedConfig)) {
      preferences.getBytes(key, &stations[i].cfg, sizeof(BedConfig));
      stations[i].cfg.dropFactor = safeDropFactor(stations[i].cfg.dropFactor);
      stations[i].cfg.patientName[sizeof(stations[i].cfg.patientName) - 1] = '\0';
    }
    char pkey[6];
    snprintf(pkey, sizeof(pkey), "p%d", i + 1);
    stations[i].nearEndPct = safeNearPct(preferences.getUChar(pkey, DEFAULT_NEAR_END_PCT));
    stations[i].trialCase.active     = stations[i].cfg.planVolumeMl > 0;
    stations[i].trialCase.planVolume = stations[i].cfg.planVolumeMl;
    stations[i].trialCase.targetRate = stations[i].cfg.targetRateHr;
  }
  preferences.end();
}

void saveBedConfig(int idx) {
  char key[6];
  snprintf(key, sizeof(key), "b%d", idx + 1);
  preferences.begin("bed-cfg", false);
  preferences.putBytes(key, &stations[idx].cfg, sizeof(BedConfig));
  char pkey[6];
  snprintf(pkey, sizeof(pkey), "p%d", idx + 1);
  preferences.putUChar(pkey, stations[idx].nearEndPct);
  preferences.end();
}

// ----------------------------------------------------------------------------
// ระบบเวลาและการซิงก์ข้อมูล
// ----------------------------------------------------------------------------
String getFormattedDateTime() {
  struct tm timeinfo;
  if (!getLocalTime(&timeinfo, 10)) {
    char buf[24];
    snprintf(buf, sizeof(buf), "Min-%04u", (unsigned)globalMinuteCounter);
    return String(buf);
  }
  char buf[24];
  strftime(buf, sizeof(buf), "%Y-%m-%d %H:%M:%S", &timeinfo);
  return String(buf);
}

String getDisplayClockStr() {
  struct tm timeinfo;
  if (!getLocalTime(&timeinfo, 10)) return "--:--";
  char buf[12];
  strftime(buf, sizeof(buf), "%H:%M", &timeinfo);
  return String(buf);
}

// นาฬิกาพร้อมใช้งานหรือยัง (ตั้งจากเครื่องผู้ใช้ หรือกู้จากค่าที่สำรองไว้)
bool hasValidClock() {
  time_t now;
  time(&now);
  return now > 1600000000;
}

// บันทึกเวลาปัจจุบันลง NVS เพื่อกู้คืนเมื่อไฟดับ (ไม่มี RTC สำรองในบอร์ด)
void backupClockToNvs() {
  time_t now;
  time(&now);
  if (now <= 1600000000) return;
  preferences.begin("sys-config", false);
  preferences.putUInt("lastEpoch", (uint32_t)now);
  preferences.end();
}


// ============================================================================
// นาฬิกาสำรอง DS3231 (I2C) และการบันทึกข้อมูลลง SD card (ช่องบนหลังจอ)
// ----------------------------------------------------------------------------
//  DS3231 : เก็บวันที่-เวลาไว้แม้ไฟดับ (มีถ่านกระดุมในตัว) ความคลาดเคลื่อนต่ำมาก
//           เวลาที่เก็บเป็น UTC ส่วนการแสดงผลแปลงเป็นเวลาไทยด้วย TZ ของระบบ
//           เมื่อเปิดหน้าเว็บจากมือถือ เวลาจากเครื่องนั้นจะถูกเขียนลง DS3231 ให้ด้วย
//  SD card: บันทึกข้อมูลรายนาทีของทุกเตียงเป็นไฟล์ CSV วันละไฟล์ (/IVLOG/YYYYMMDD_data.csv)
//           และบันทึกเหตุการณ์สำคัญไว้อีกไฟล์ (/IVLOG/YYYYMMDD_event.csv)
//           ดาวน์โหลดไฟล์ได้จากหน้าเว็บ (แท็บ Log & Shift Report)
// ============================================================================
RTC_DS3231 rtc;
bool rtcPresent  = false;     // ตรวจพบโมดูล DS3231
bool rtcTimeOk   = false;     // เวลาใน DS3231 ใช้งานได้ (ไม่ได้ไฟหมด)
bool sdPresent   = false;     // ใส่ SD card และ mount ได้
uint32_t sdRowsWritten = 0;   // จำนวนแถวข้อมูลที่เขียนลง SD แล้ว (นับตั้งแต่เปิดเครื่อง)
char sdDateStr[12] = "nodate";
unsigned long lastSdRetry  = 0;
unsigned long lastRtcCheck = 0;
uint8_t lastLoggedAlert[MAX_SUPPORTED_STATIONS];

// ---------------------------------------------------------------- DS3231
void initRtc() {
  Wire.begin(RTC_SDA_PIN, RTC_SCL_PIN);
  rtcPresent = rtc.begin(&Wire);
  if (!rtcPresent) {
    Serial.println("[RTC] DS3231 not found");
    return;
  }
  rtcTimeOk = !rtc.lostPower();
  if (!rtcTimeOk) {
    Serial.println("[RTC] DS3231 lost power - waiting for time from web");
    return;
  }
  DateTime now = rtc.now();
  uint32_t epoch = now.unixtime();
  if (epoch > 1600000000UL) {
    struct timeval tv = { (time_t)epoch, 0 };
    settimeofday(&tv, NULL);
    isTimeSynced = true;      // DS3231 เป็นแหล่งเวลาที่เชื่อถือได้
    isTimeApprox = false;
  } else {
    rtcTimeOk = false;
  }
}

// เขียนเวลาปัจจุบันของระบบลง DS3231 (เรียกเมื่อหน้าเว็บส่งเวลามาให้)
void syncRtcFromSystem() {
  if (!rtcPresent) return;
  time_t now;
  time(&now);
  if (now <= 1600000000) return;
  rtc.adjust(DateTime((uint32_t)now));
  rtcTimeOk = true;
}

// อ่านเวลาจาก DS3231 มาแก้ค่าเวลาของระบบเป็นระยะ (กันนาฬิกาภายในชิปเดินคลาด)
void serviceRtc(unsigned long nowMs) {
  if (!rtcPresent || !rtcTimeOk) return;
  if (nowMs - lastRtcCheck < 3600000UL) return;    // ทุก 1 ชั่วโมง
  lastRtcCheck = nowMs;
  DateTime t = rtc.now();
  uint32_t epoch = t.unixtime();
  if (epoch <= 1600000000UL) return;
  time_t sys;
  time(&sys);
  if (abs((long)(epoch - (uint32_t)sys)) >= 2) {   // ต่างกันเกิน 2 วินาทีจึงปรับ
    struct timeval tv = { (time_t)epoch, 0 };
    settimeofday(&tv, NULL);
  }
}

String rtcStatusText() {
  if (!rtcPresent) return String("not found");
  return rtcTimeOk ? String("OK") : String("set time on web");
}

// ---------------------------------------------------------------- SD card
void sdUpdateDateStr() {
  struct tm ti;
  if (!getLocalTime(&ti, 10)) {
    snprintf(sdDateStr, sizeof(sdDateStr), "nodate");
    return;
  }
  strftime(sdDateStr, sizeof(sdDateStr), "%Y%m%d", &ti);
}

String sdDataPath()  { return "/IVLOG/" + String(sdDateStr) + "_data.csv"; }
String sdEventPath() { return "/IVLOG/" + String(sdDateStr) + "_event.csv"; }

