kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Host-Touch-V_4_9_0/ESP32-S3-Host-Touch-V_4_9_0.ino
bool initSdCard() {
  sdPresent = SD.begin(SD_CS_PIN, SPI_TFT, SD_SPI_HZ);
  if (!sdPresent) {
    Serial.println("[SD] card not found");
    return false;
  }
  if (!SD.exists("/IVLOG")) SD.mkdir("/IVLOG");
  sdUpdateDateStr();
  Serial.printf("[SD] ready, logging to %s\n", sdDataPath().c_str());
  return true;
}

// บันทึกเหตุการณ์ (เริ่มถุงใหม่ แก้ค่า เกิดเหตุเตือน ฯลฯ) — bedIdx = -1 คือเหตุการณ์ของระบบ
void sdLogEvent(const char* type, int bedIdx, const String &detail) {
  if (!sdPresent) return;
  sdUpdateDateStr();
  String path = sdEventPath();
  bool isNew = !SD.exists(path);
  File f = SD.open(path, FILE_APPEND);
  if (!f) { sdPresent = false; return; }
  if (isNew) f.println(F("datetime,type,bed,detail"));
  f.print(getFormattedDateTime());
  f.print(',');
  f.print(type);
  f.print(',');
  if (bedIdx >= 0) f.print(bedIdx + 1); else f.print('-');
  f.print(',');
  f.println(detail);
  f.close();
}

// บันทึกข้อมูลรายนาทีของทุกเตียงลงไฟล์ CSV (เรียกจากรอบบันทึก log รายนาทีใน loop)
void sdLogMinute(const String &timestamp) {
  if (!sdPresent) return;
  sdUpdateDateStr();
  String path = sdDataPath();
  bool isNew = !SD.exists(path);
  File f = SD.open(path, FILE_APPEND);
  if (!f) {
    sdPresent = false;                 // ถอดการ์ดออกกลางคัน -> หยุดบันทึกและลองใหม่ภายหลัง
    return;
  }
  if (isNew) f.println(F("datetime,minute,bed,patient,drops,volume_ml,rate_mlhr,target_mlhr,alert,rssi,battery_v"));

  for (int i = 0; i < activeStationCount; i++) {
    const StationData &s = stations[i];
    if (s.logCount == 0) continue;
    const LogEntry &e = s.logs[s.logCount - 1];
    f.print(timestamp);            f.print(',');
    f.print(e.minuteIndex);        f.print(',');
    f.print(i + 1);                f.print(',');
    f.print(s.cfg.patientName);    f.print(',');
    f.print(e.drops);              f.print(',');
    f.print(e.volume, 1);          f.print(',');
    f.print(e.rateHr, 1);          f.print(',');
    f.print(e.targetRate, 0);      f.print(',');
    f.print(alertTextEn(e.alertCode)); f.print(',');
    f.print(e.rssi);               f.print(',');
    f.println(e.battery, 2);
    sdRowsWritten++;
  }
  f.close();
}

// ตรวจการ์ดซ้ำเป็นระยะ เผื่อเพิ่งเสียบเข้าไป หรือหลุดกลางทาง
void serviceSdCard(unsigned long nowMs) {
  if (sdPresent) return;
  if (nowMs - lastSdRetry < 30000UL) return;
  lastSdRetry = nowMs;
  SD.end();
  initSdCard();
}

String sdStatusText() {
  if (!sdPresent) return String("no card");
  return String(sdRowsWritten) + " rows";
}

// บันทึกเมื่อรหัสเตือนของเตียงเปลี่ยน (เรียกทุกวินาทีหลังประเมินการแจ้งเตือน)
void sdLogAlertChanges() {
  if (!sdPresent) return;
  for (int i = 0; i < activeStationCount; i++) {
    uint8_t code = stations[i].alertCode;
    if (code == lastLoggedAlert[i]) continue;
    lastLoggedAlert[i] = code;
    if (code == ALERT_NONE) sdLogEvent("ALERT_CLEAR", i, String("back to normal"));
    else                    sdLogEvent("ALERT", i, String(alertTextEn(code)));
  }
}

void broadcastSyncToNodes() {
  time_t now;
  time(&now);
  uint8_t ch = currentWifiChannel();

  for (int i = 0; i < activeStationCount; i++) {
    struct_host_sync syncMsg = {};
    syncMsg.epochTime    = (now > 1600000000) ? (uint32_t)now : 0;
    syncMsg.isSynced     = (now > 1600000000) ? 1 : 0;
    syncMsg.stationId    = i + 1;
    syncMsg.targetRateHr = stations[i].cfg.targetRateHr;
    syncMsg.totalPlanMl  = stations[i].cfg.planVolumeMl;
    syncMsg.alertCode    = stations[i].alertCode;
    syncMsg.dropFactor   = safeDropFactor(stations[i].cfg.dropFactor);
    syncMsg.resetSeq     = stations[i].cfg.resetSeq;
    syncMsg.hostChannel  = ch;
    syncMsg.nearEndPct   = safeNearPct(stations[i].nearEndPct);
    syncMsg.flags        = stations[i].nearEndAck ? 0x01 : 0x00;

    esp_err_t r = esp_now_send(broadcastAddress, (uint8_t *)&syncMsg, sizeof(syncMsg));
    if (r != ESP_OK) {
      delay(10);
      esp_now_send(broadcastAddress, (uint8_t *)&syncMsg, sizeof(syncMsg));
    }
    delay(4);
  }
}

// ---- ควบคุมความสว่างไฟหน้าจอด้วย PWM ----
void setBacklightRaw(int pct) {
#if TFT_BLK >= 0
  if (pct < 0) pct = 0;
  if (pct > 100) pct = 100;
  #if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
    ledcWrite(TFT_BLK, (pct * 255) / 100);
  #else
    ledcWrite(0, (pct * 255) / 100);
  #endif
#else
  (void)pct;
#endif
}

void setScreenBrightness(int pct) {
  if (pct < 25) pct = 25;
  if (pct > 100) pct = 100;
  screenBrightness = (uint8_t)pct;
  backlightDimmed = false;
  setBacklightRaw(screenBrightness);
  preferences.begin("sys-config", false);
  preferences.putUChar("bright", screenBrightness);
  preferences.end();
}

float readHostBattery() {
  int raw = analogRead(HOST_BAT_ADC_PIN);
  float volts = (raw / 4095.0) * 3.3 * 2.0;
  if (volts > 4.25) volts = 4.2;
  if (volts < 2.5) volts = 0.0;
  return volts;
}

int calculateBatteryPct(float volts) {
  if (volts <= 0.5) return 100;
  int pct = (int)(((volts - 3.2) / (4.2 - 3.2)) * 100.0);
  if (pct > 100) pct = 100;
  if (pct < 0) pct = 0;
  return pct;
}

void playWelcomeMelody() {
  int melody[] = { 523, 659, 784, 1046 };
  int durations[] = { 80, 80, 80, 200 };
  for (int i = 0; i < 4; i++) {
    tone(BUZZER_PIN, melody[i], durations[i]);
    delay(durations[i] + 30);
  }
  noTone(BUZZER_PIN);
}

void playShutdownMelody() {
  int melody[] = { 1046, 784, 659, 523 };
  int durations[] = { 80, 80, 80, 250 };
  for (int i = 0; i < 4; i++) {
    tone(BUZZER_PIN, melody[i], durations[i]);
    delay(durations[i] + 30);
  }
  noTone(BUZZER_PIN);
}

// ----------------------------------------------------------------------------
// ระบบควบคุม Power & Deep Sleep (ESP32-S3 ใช้ ext0 wakeup)
// ----------------------------------------------------------------------------
void enterDeepSleepWaitPowerButton() {
  rtc_gpio_pullup_en((gpio_num_t)POWER_BTN_PIN);
  rtc_gpio_pulldown_dis((gpio_num_t)POWER_BTN_PIN);
  esp_sleep_enable_ext0_wakeup((gpio_num_t)POWER_BTN_PIN, 0);
  esp_deep_sleep_start();
}

void powerOffSystem() {
  isPowerOffProgressActive = true;

  drawGoodbyeScreen();

  playShutdownMelody();

