kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Host-Touch-V_4_9_0/ESP32-S3-Host-Touch-V_4_9_0.ino
  while (digitalRead(POWER_BTN_PIN) == LOW) delay(20);
  delay(200);

  tft.fillScreen(0x0000);
#if TFT_BLK >= 0
  digitalWrite(TFT_BLK, LOW);
#endif

  server.stop();
  esp_now_deinit();
  WiFi.disconnect(true);
  WiFi.mode(WIFI_OFF);

  enterDeepSleepWaitPowerButton();
}

// ----------------------------------------------------------------------------
// ประเมินสภาวะเตือนภัย (Host เป็นผู้ตัดสินจุดเดียว)
// ----------------------------------------------------------------------------
void evaluateClinicalAlerts() {
  bool anyCritical = false;
  unsigned long now = millis();

  for (int i = 0; i < activeStationCount; i++) {
    StationData &s = stations[i];
    if (!isStationOnline(i) || !s.isRunning) {
      s.alertCode = ALERT_NONE;
      s.deviationSince = 0;
      continue;
    }

    float tr   = s.cfg.targetRateHr;
    float act  = s.flowRate_ml_hr;
    float vol  = s.totalVolumeMl;
    float plan = s.cfg.planVolumeMl;
    uint8_t code = ALERT_NONE;

    if (isStationOccluded(i)) {
      code = ALERT_OCCLUSION;
      s.deviationSince = 0;
    } else if (plan > 0 && vol >= plan) {
      code = ALERT_COMPLETE;
      s.deviationSince = 0;
    } else {
      bool rateValid = (act > 0.0f) && (s.totalDrops >= 3);
      uint8_t devCode = ALERT_NONE;
      if (tr > 0 && rateValid && act > tr * 1.35f)      devCode = ALERT_TOO_FAST;
      else if (tr > 0 && rateValid && act < tr * 0.65f) devCode = ALERT_TOO_SLOW;

      if (devCode != ALERT_NONE) {
        if (s.deviationSince == 0) s.deviationSince = now;
        if (now - s.deviationSince >= RATE_DEVIATION_HOLD_MS) code = devCode;
      } else {
        s.deviationSince = 0;
      }

      if (code == ALERT_NONE && plan > 0 && vol >= plan * (float)safeNearPct(s.nearEndPct) / 100.0f) code = ALERT_NEAR_END;
    }

    s.alertCode = code;
    if (isCriticalAlert(code)) anyCritical = true;
  }

  // ถ้าไม่มีเหตุวิกฤตแล้ว ยกเลิก snooze เพื่อให้เหตุการณ์ครั้งถัดไปดังทันที
  if (!anyCritical) globalSnoozeUntil = 0;
  globalAlarmTriggered = anyCritical;
}

bool anyNearEndPending() {
  for (int i = 0; i < activeStationCount; i++) {
    if (stations[i].alertCode == ALERT_NEAR_END && !stations[i].nearEndAck) return true;
  }
  return false;
}

void acknowledgeAllNearEnd() {
  for (int i = 0; i < activeStationCount; i++) {
    if (stations[i].alertCode == ALERT_NEAR_END) stations[i].nearEndAck = true;
  }
  nearChimeRemaining = 0;
}

// เสียงเตือนใกล้หมด: 3 ครั้งสั้น ๆ ต่อเตียง ซ้ำทุก 5 นาทีจนกว่าจะรับทราบ (ไม่ดังทับเหตุวิกฤต)
void handleNearEndChime() {
  unsigned long now = millis();
  if (globalAlarmTriggered && !isSnoozed()) { nearChimeRemaining = 0; return; }

  if (nearChimeRemaining == 0) {
    for (int i = 0; i < activeStationCount; i++) {
      StationData &s = stations[i];
      if (s.alertCode != ALERT_NEAR_END || s.nearEndAck) { s.nearNextChime = 0; continue; }
      if (s.nearNextChime == 0 || now >= s.nearNextChime) {
        s.nearNextChime = now + NEAR_END_REMIND_MS;
        nearChimeRemaining = 3;
        nearChimeNextBeep = now;
        break;
      }
    }
  }
  if (nearChimeRemaining > 0 && now >= nearChimeNextBeep) {
    tone(BUZZER_PIN, 2000, 70);
    nearChimeNextBeep = now + 220;
    nearChimeRemaining--;
  }
}

void handleBuzzerAlarm() {
  static uint8_t beepPhase = 0;
  if (!globalAlarmTriggered || isSnoozed()) {
    beepPhase = 0;
    handleNearEndChime();
    return;
  }

  unsigned long now = millis();
  if (beepPhase == 0 && now - lastBuzzerAlarmTime >= 2500) {
    tone(BUZZER_PIN, 1500, 100);
    lastBuzzerAlarmTime = now;
    beepPhase = 1;
  } else if (beepPhase == 1 && now - lastBuzzerAlarmTime >= 200) {
    tone(BUZZER_PIN, 1500, 100);
    beepPhase = 0;
  }
}

// ============================================================================
// ปุ่ม multifunction ปุ่มเดียว (ขา POWER_BTN_PIN)
//   คลิก 1 ครั้ง : มีเสียงเตือน = พักเสียง / มีเตือนใกล้หมด = รับทราบทุกเตียง
//                  จอดับอยู่ = ปลุกจอ / อยู่หน้าย่อย = ย้อนกลับ
//   ดับเบิลคลิก  : ปิด/เปิดหน้าจอ (ระบบยังทำงานและยังเตือนตามปกติ)
//   กดค้าง 2 วิ  : ปิดเครื่อง (ปลุกด้วยการกดค้าง 2 วินาทีอีกครั้ง)
// ============================================================================
void handleShortClick() {
  lastUserActivityTime = millis();

  if (globalAlarmTriggered && !isSnoozed()) {
    globalSnoozeUntil = millis() + SNOOZE_MS;
    noTone(BUZZER_PIN);
    tone(BUZZER_PIN, 2200, 40);
    if (displaySleeping) setDisplaySleep(false);
    uiScreen = SCR_HOME;
    uiNeedFramework = true;
    return;
  }
  if (anyNearEndPending()) {
    acknowledgeAllNearEnd();
    tone(BUZZER_PIN, 2600, 40);
    if (displaySleeping) setDisplaySleep(false);
    uiNeedFramework = true;
    return;
  }
  if (displaySleeping) {
    setDisplaySleep(false);
    return;
  }
  if (uiScreen != SCR_HOME) {
    uiGoBack();
    tone(BUZZER_PIN, 2000, 15);
    return;
  }
  tone(BUZZER_PIN, 1600, 15);          // อยู่หน้าหลักอยู่แล้ว
}

void checkMultifunctionButton() {
  static unsigned long btnPressStart = 0;
  static unsigned long lastProgressFrameTime = 0;
  static unsigned long lastReleaseTime = 0;
  static bool isHolding = false;
  static int clickCount = 0;

  unsigned long now = millis();
  int btnState = digitalRead(POWER_BTN_PIN);

  if (btnState == LOW) {
    if (!isHolding) {
      btnPressStart = now;
      isHolding = true;
    }
    unsigned long holdDuration = now - btnPressStart;

    if (holdDuration >= 450 && !displaySleeping) {
      isPowerOffProgressActive = true;
      if (now - lastProgressFrameTime >= 60) {
        lastProgressFrameTime = now;
        drawPowerOffProgress(map(holdDuration, 450, 2000, 0, 100));
      }
    }
    if (holdDuration >= 2000) powerOffSystem();
  }
  else if (isHolding) {
    unsigned long totalHoldTime = now - btnPressStart;
    isHolding = false;
    btnPressStart = 0;

    if (isPowerOffProgressActive) {          // กดค้างแล้วปล่อยก่อนครบ = ยกเลิก
      isPowerOffProgressActive = false;
      uiScreenDrawn = (UiScreen)-1;
      uiNeedFramework = true;
      updateHostDisplay();
    } else if (totalHoldTime < 400) {
      clickCount++;                          // รอดูว่าจะมีคลิกที่สองหรือไม่
      lastReleaseTime = now;
    }
  }

