kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Host-Touch-V_4_9_0/ESP32-S3-Host-Touch-V_4_9_0.ino
  // ตัดสินว่าเป็นคลิกเดียวหรือดับเบิลคลิก เมื่อไม่มีการกดเพิ่มภายใน 280 ms
  if (clickCount > 0 && !isHolding && (now - lastReleaseTime > 280)) {
    if (clickCount >= 2) {
      lastUserActivityTime = now;
      setDisplaySleep(!displaySleeping);     // ดับเบิลคลิก = ปิด/เปิดจอ
      tone(BUZZER_PIN, 1800, 25);
    } else {
      handleShortClick();
    }
    clickCount = 0;
    if (!displaySleeping) updateHostDisplay();
  }
}

// ----------------------------------------------------------------------------
// ESP-NOW Receive Callback
// ----------------------------------------------------------------------------
#if defined(ESP_IDF_VERSION) && ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
void OnDataRecv(const esp_now_recv_info_t *info, const uint8_t *incomingDataBytes, int len) {
  int8_t pktRssi = (info && info->rx_ctrl) ? info->rx_ctrl->rssi : -60;
#else
void OnDataRecv(const uint8_t *mac, const uint8_t *incomingDataBytes, int len) {
  int8_t pktRssi = -60;
#endif
  if (len != sizeof(struct_message)) return;

  struct_message incoming;
  memcpy(&incoming, incomingDataBytes, sizeof(incoming));
  if (incoming.stationId < 1 || incoming.stationId > MAX_SUPPORTED_STATIONS) return;

  int idx = incoming.stationId - 1;
  portENTER_CRITICAL(&dataMux);
  StationData &s = stations[idx];

  // นับหยดรายนาทีจากผลต่าง totalDrops (แพ็กเก็ตหายก็ไม่ทำให้หยดหาย)
  if (s.hasBaseline) {
    uint32_t delta = (incoming.totalDrops >= s.lastTotalDrops)
                     ? (incoming.totalDrops - s.lastTotalDrops)
                     : incoming.totalDrops;   // Station รีเซ็ต/รีบูต
    s.dropsInCurrentMinute += delta;
  } else {
    s.hasBaseline = true;
  }
  s.lastTotalDrops  = incoming.totalDrops;

  s.active          = true;
  s.isRunning       = (incoming.isRunning != 0);
  s.rssi            = pktRssi;
  s.batteryVolts    = incoming.batteryVolts;
  s.totalDrops      = incoming.totalDrops;
  s.flowRate_ml_hr  = s.isRunning ? incoming.flowRateHr : 0.0f;
  s.msSinceLastDrop = incoming.msSinceLastDrop;
  s.totalVolumeMl   = (float)s.totalDrops / (float)safeDropFactor(s.cfg.dropFactor);
  s.lastRecvTime    = millis();
  if ((incoming.flags & 0x01) && s.cfg.planVolumeMl > 0) s.nearEndAck = true;

  if (s.trialCase.active) {
    s.trialCase.actualVolume = s.totalVolumeMl;
    s.trialCase.errorMl = s.trialCase.actualVolume - s.trialCase.planVolume;
    if (s.trialCase.planVolume > 0) {
      s.trialCase.errorPercent = (s.trialCase.errorMl / s.trialCase.planVolume) * 100.0;
    }
  }
  portEXIT_CRITICAL(&dataMux);
}

// ----------------------------------------------------------------------------
// Host OLED Display & Block-Style UI Renderer
// ----------------------------------------------------------------------------
// ============================================================================
// ส่วนแสดงผลและระบบสัมผัส — จอ 2.4" (ST7789V/ILI9341 240x320 แนวตั้ง) + ทัช XPT2046
// ใช้งานเหมือนสมาร์ตโฟน: แตะการ์ดเพื่อเข้าดู แตะปุ่มเพื่อสั่งงาน แก้ค่าได้บนจอโดยตรง
//
//   HOME     : เตียงที่ต้องดูตอนนี้ตัวใหญ่ (FOCUS) + รายการเตียงอื่นแบบแตะได้
//   BED      : รายละเอียดเตียง + ปุ่มสั่งงาน (ถุงใหม่ / รับทราบ / หยุดพัก / ตั้งค่า)
//   BED SET  : ตั้งค่าของเตียงด้วยปุ่ม - + หรือแตะที่ค่าเพื่อพิมพ์ตัวเลข
//   NUMPAD   : แป้นตัวเลขบนจอ
//   SYSTEM   : ตั้งค่าระบบ (จำนวนเตียง ความสว่าง ปรับจอสัมผัส ข้อมูล Wi-Fi)
//   ALARM    : จอเตือนเต็มจอ แตะที่ไหนก็ได้เพื่อพักเสียง
//   CALIB    : ปรับความแม่นจอสัมผัส (เก็บค่าไว้ใน NVS)
// ============================================================================

// ---- สีที่ใช้บนจอ (RGB565) ----
#define C_BG        0x0000
#define C_CARD      0x18C5
#define C_CARD2     0x10A2
#define C_BAR       0x2104
#define C_TOPBAR    0x0A49
#define C_BTN       0x2945
#define C_LINE      0x39E7
#define C_DIM       0x8410
#define C_WHITE     0xFFFF
#define C_GREEN     0x2FEB
#define C_CYAN      0x07FF
#define C_YELLOW    0xFFE0
#define C_ORANGE    0xFD20
#define C_RED       0xF800
#define C_SKY       0x5DFF

// ---- ผังหน้าจอแนวตั้ง 240x320 ----
#define SCR_W       240
#define SCR_H       320
#define TOPBAR_H    22

// ค่าที่กำลังแก้ชั่วคราว (ยังไม่บันทึกจนกว่าจะกด SAVE)
float editTargetRate = 0, editPlanVolume = 0;
uint8_t editDropFactor = 20, editNearPct = DEFAULT_NEAR_END_PCT;
char editNumBuf[8] = "";           // ตัวเลขที่พิมพ์ในหน้า NUMPAD
int  editNumMax = 999;
const char* editNumLabel = "";
const char* editNumUnit  = "";

// ---- แคชข้อความ เพื่อวาดเฉพาะส่วนที่เปลี่ยน ----
String cacheClock = "", cacheTopRight = "", cacheFocusKey = "", cacheStatusWord = "";
String cacheRate = "", cacheSetRate = "", cacheSummary = "", cacheBottom = "";
String cacheSide[MAX_SUPPORTED_STATIONS];
String cacheBedKey = "", cacheAlarmRate = "", cacheNumValue = "";
int    cachePct = -999;

// ---- สถานะเตียงสำหรับการแสดงผล ----
enum BedUiStatus { BU_NORMAL = 0, BU_FAST, BU_SLOW, BU_NOFLOW, BU_NEAREND, BU_DONE, BU_PAUSED, BU_OFFLINE };

BedUiStatus bedUiStatus(int i) {
  if (!isStationOnline(i)) return BU_OFFLINE;
  const StationData &s = stations[i];
  if (!s.isRunning) return BU_PAUSED;
  switch (s.alertCode) {
    case ALERT_OCCLUSION: return BU_NOFLOW;
    case ALERT_TOO_FAST:  return BU_FAST;
    case ALERT_TOO_SLOW:  return BU_SLOW;
    case ALERT_COMPLETE:  return BU_DONE;
    case ALERT_NEAR_END:  return BU_NEAREND;
    default:              return BU_NORMAL;
  }
}

uint16_t bedColor(BedUiStatus s) {
  switch (s) {
    case BU_NORMAL:  return C_GREEN;
    case BU_FAST:    return C_ORANGE;
    case BU_SLOW:    return C_YELLOW;
    case BU_NOFLOW:  return C_RED;
    case BU_NEAREND: return C_ORANGE;
    case BU_DONE:    return C_CYAN;
    case BU_PAUSED:  return C_SKY;
    default:         return C_LINE;
  }
}

const char* bedWord(BedUiStatus s) {
  switch (s) {
    case BU_NORMAL:  return "NORMAL";
    case BU_FAST:    return "TOO FAST";
    case BU_SLOW:    return "TOO SLOW";
    case BU_NOFLOW:  return "NO FLOW";
    case BU_NEAREND: return "NEXT BAG";
    case BU_DONE:    return "COMPLETE";
    case BU_PAUSED:  return "PAUSED";
    default:         return "OFFLINE";
  }
}

bool bedIsAlarm(BedUiStatus s) {
  return s == BU_FAST || s == BU_SLOW || s == BU_NOFLOW || s == BU_DONE;
}

// ---- ตัวช่วยวางข้อความ (ฟอนต์มาตรฐาน 6xsize กว้าง, 8xsize สูง) ----
void textAt(const String &s, int x, int y, uint8_t size, uint16_t col, uint16_t bg) {
  tft.setTextSize(size);
  tft.setTextColor(col, bg);
  tft.setCursor(x, y);
  tft.print(s);
}
void textRight(const String &s, int xr, int y, uint8_t size, uint16_t col, uint16_t bg) {
  textAt(s, xr - (int)s.length() * 6 * size, y, size, col, bg);
}
void textCenterIn(const String &s, int x, int w, int y, uint8_t size, uint16_t col, uint16_t bg) {
  textAt(s, x + (w - (int)s.length() * 6 * size) / 2, y, size, col, bg);
}
String padTo(const String &s, unsigned int width) {
  String out = s;
  while (out.length() < width) out += ' ';
  return out;
}

void drawProgressBar(int x, int y, int w, int h, int pct, uint16_t fill) {
  if (pct < 0) pct = 0;
  if (pct > 100) pct = 100;
  tft.fillRoundRect(x, y, w, h, h / 2, C_BAR);
  int fw = w * pct / 100;
  if (fw >= h) tft.fillRoundRect(x, y, fw, h, h / 2, fill);
  else if (fw > 0) tft.fillRect(x, y, fw, h, fill);
}

void drawWifiIcon(int x, int y, int clients) {
  int h[4] = {3, 6, 9, 12};
  for (int i = 0; i < 4; i++) tft.fillRect(x + i * 4, y + (12 - h[i]), 3, h[i], (clients > i) ? C_GREEN : C_LINE);
}

void drawBatteryIcon(int x, int y, int pct) {
  tft.drawRoundRect(x, y, 20, 10, 2, C_DIM);
  tft.fillRect(x + 20, y + 3, 2, 4, C_DIM);
  tft.fillRect(x + 2, y + 2, 16, 6, C_BG);
  uint16_t c = (pct <= 20) ? C_RED : (pct <= 50 ? C_YELLOW : C_GREEN);
  int w = (16 * pct) / 100;
  if (w > 0) tft.fillRect(x + 2, y + 2, w, 6, c);
}

// ---- ปุ่มบนจอ (ความสูงอย่างน้อย 34 px เพื่อให้แตะง่าย) ----
struct TouchZone { int x, y, w, h; };

bool zoneHit(const TouchZone &z, int tx, int ty) {
  return tx >= z.x && tx < z.x + z.w && ty >= z.y && ty < z.y + z.h;
}

void drawButton(const TouchZone &z, const String &label, uint16_t bg, uint16_t fg, uint8_t size = 1) {
  tft.fillRoundRect(z.x, z.y, z.w, z.h, 6, bg);
  textCenterIn(label, z.x, z.w, z.y + (z.h - 8 * size) / 2, size, fg, bg);
}

// ---- ข้อมูลของเตียงที่ใช้บ่อย ----
int bedPct(int i) {
  const StationData &s = stations[i];
  if (s.cfg.planVolumeMl <= 0) return -1;
  int p = (int)(s.totalVolumeMl * 100.0f / s.cfg.planVolumeMl + 0.5f);
  return (p > 100) ? 100 : p;
}

