kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Host-Touch-V_4_9_0/ESP32-S3-Host-Touch-V_4_9_0.ino
int bedMinutesLeft(int i) {
  const StationData &s = stations[i];
  if (s.cfg.planVolumeMl <= 0 || !isStationOnline(i) || !s.isRunning) return -1;
  if (s.alertCode == ALERT_OCCLUSION) return -1;
  float left = s.cfg.planVolumeMl - s.totalVolumeMl;
  if (left < 0) left = 0;
  float rate = (s.flowRate_ml_hr > 5.0f) ? s.flowRate_ml_hr : s.cfg.targetRateHr;
  if (rate <= 0) return -1;
  return (int)((left / rate) * 60.0f);
}

int autoFocusBed() {
  for (int i = 0; i < activeStationCount; i++) if (bedIsAlarm(bedUiStatus(i))) return i;
  for (int i = 0; i < activeStationCount; i++)
    if (stations[i].alertCode == ALERT_NEAR_END && !stations[i].nearEndAck) return i;
  return -1;
}

int currentFocusBed() {
  int a = autoFocusBed();
  if (a >= 0) return a;
  if (manualFocusBed >= 0 && manualFocusBed < activeStationCount) return manualFocusBed;
  return 0;
}

// ============================================================================
// ระบบจอสัมผัส XPT2046 — อ่านค่าดิบ แปลงเป็นพิกัดจอ และปรับความแม่น (Calibration)
// ============================================================================
XPT2046_Touchscreen ts(TOUCH_CS_PIN, TOUCH_IRQ_PIN);

// ค่าปรับความแม่น (ค่าดิบที่มุมจอ) — ค่าเริ่มต้นใช้ได้กับโมดูลส่วนใหญ่ ปรับใหม่ได้จากหน้าตั้งค่า
int touchRawX0 = 300, touchRawX1 = 3800, touchRawY0 = 300, touchRawY1 = 3800;
bool touchCalibrated = false;

unsigned long lastTouchEventMs = 0;
bool touchWasDown = false;

void loadTouchCalibration() {
  preferences.begin("sys-config", true);
  touchRawX0 = preferences.getInt("tx0", 300);
  touchRawX1 = preferences.getInt("tx1", 3800);
  touchRawY0 = preferences.getInt("ty0", 300);
  touchRawY1 = preferences.getInt("ty1", 3800);
  touchCalibrated = preferences.getUChar("tcal", 0) == 1;
  preferences.end();
}

void saveTouchCalibration() {
  preferences.begin("sys-config", false);
  preferences.putInt("tx0", touchRawX0);
  preferences.putInt("tx1", touchRawX1);
  preferences.putInt("ty0", touchRawY0);
  preferences.putInt("ty1", touchRawY1);
  preferences.putUChar("tcal", 1);
  preferences.end();
  touchCalibrated = true;
}

// แปลงค่าดิบของ XPT2046 เป็นพิกัดบนจอ (คิดการหมุนจอด้วย)
void mapTouch(int rawX, int rawY, int &sx, int &sy) {
  long x = map(rawX, touchRawX0, touchRawX1, 0, SCR_W - 1);
  long y = map(rawY, touchRawY0, touchRawY1, 0, SCR_H - 1);
  if (x < 0) x = 0;
  if (x > SCR_W - 1) x = SCR_W - 1;
  if (y < 0) y = 0;
  if (y > SCR_H - 1) y = SCR_H - 1;
#if TOUCH_SWAP_XY
  long t = x; x = y; y = t;
#endif
#if TOUCH_FLIP_X
  x = SCR_W - 1 - x;
#endif
#if TOUCH_FLIP_Y
  y = SCR_H - 1 - y;
#endif
  sx = (int)x;
  sy = (int)y;
}

// คืนค่า true หนึ่งครั้งต่อการแตะหนึ่งครั้ง (กันการแตะรัวและการสั่นของจอความต้านทาน)
bool readTap(int &tx, int &ty) {
  bool down = ts.touched();
  if (!down) {
    touchWasDown = false;
    return false;
  }
  if (touchWasDown) return false;                       // ยังกดค้างอยู่จากครั้งก่อน
  unsigned long now = millis();
  if (now - lastTouchEventMs < 180) return false;       // กันแตะซ้ำเร็วเกินไป

  TS_Point p = ts.getPoint();
  if (p.z < TOUCH_MIN_PRESSURE) return false;           // แรงกดน้อยเกินไป ถือว่าไม่ได้ตั้งใจ
  touchWasDown = true;
  lastTouchEventMs = now;
  mapTouch(p.x, p.y, tx, ty);
  lastUserActivityTime = now;
  return true;
}

// ============================================================================
// แถบบนสุดและแถบล่างที่ใช้ร่วมกันทุกหน้า
// ============================================================================
void drawStatusBar(bool force) {
  if (force) {
    tft.fillRect(0, 0, SCR_W, TOPBAR_H, C_TOPBAR);
    cacheClock = ""; cacheTopRight = "";
  }
  String clockStr = getDisplayClockStr();
  if (clockStr != cacheClock) {
    cacheClock = clockStr;
    textAt(clockStr, 6, 7, 1, isTimeApprox ? C_YELLOW : C_WHITE, C_TOPBAR);
  }
  String right = String(WiFi.softAPgetStationNum()) + ":" + String(hostBatteryPct / 5);
  if (right != cacheTopRight) {
    cacheTopRight = right;
    drawWifiIcon(SCR_W - 50, 5, (int)WiFi.softAPgetStationNum());
    drawBatteryIcon(SCR_W - 28, 6, hostBatteryPct);
  }
}

// แถบหัวเรื่องของหน้าย่อย: ปุ่มย้อนกลับ (ซ้าย) + ชื่อหน้า
const TouchZone ZONE_BACK = { 4, 25, 44, 30 };

void drawTitleBar(const String &title) {
  tft.fillRect(0, TOPBAR_H, SCR_W, 36, C_CARD);
  drawButton(ZONE_BACK, "<", C_BTN, C_WHITE, 2);
  textCenterIn(title, 52, SCR_W - 104, 32, 2, C_WHITE, C_CARD);
}

// ============================================================================
// หน้า HOME — เตียงที่ต้องดูตอนนี้ตัวใหญ่ + รายการเตียงอื่น (แตะได้ทุกส่วน)
// ============================================================================
#define FOCUS_X   6
#define FOCUS_Y   26
#define FOCUS_W   228
#define FOCUS_H   122
#define LIST_Y    154
#define LIST_H    128
#define BOTBAR_Y  288

const TouchZone ZONE_FOCUS = { FOCUS_X, FOCUS_Y, FOCUS_W, FOCUS_H };
const TouchZone ZONE_GEAR  = { 190, 290, 44, 28 };
const TouchZone ZONE_ALERT = { 6, 290, 180, 28 };

int homeRowH = 30;          // ความสูงแถวรายการเตียง (ปรับตามจำนวนเตียง)
int homeRowBed[MAX_SUPPORTED_STATIONS];   // เตียงที่อยู่ในแต่ละแถว (ใช้ตอนแตะ)
int homeRowCount = 0;

void drawHomeFocusPanel(int focus, bool force) {
  BedUiStatus st = bedUiStatus(focus);
  const StationData &s = stations[focus];
  uint16_t sc = bedColor(st);

  char head[16];
  snprintf(head, sizeof(head), "BED %02d", focus + 1);
  String key = String(head) + "|" + String((int)st);
  if (force || key != cacheFocusKey) {
    cacheFocusKey = key;
    tft.fillRoundRect(FOCUS_X, FOCUS_Y, FOCUS_W, FOCUS_H, 8, C_CARD);
    tft.fillRoundRect(FOCUS_X, FOCUS_Y, FOCUS_W, 26, 8, sc);
    tft.fillRect(FOCUS_X, FOCUS_Y + 18, FOCUS_W, 8, sc);
    textAt(String(head), FOCUS_X + 8, FOCUS_Y + 6, 2, C_BG, sc);
    textRight(String(bedWord(st)), FOCUS_X + FOCUS_W - 8, FOCUS_Y + 9, 1, C_BG, sc);
    cacheRate = ""; cacheSetRate = ""; cacheSummary = ""; cachePct = -999;
  }

  String rateStr = (st == BU_OFFLINE || st == BU_PAUSED) ? String("--")
                                                         : String((int)(s.flowRate_ml_hr + 0.5f));
  if (rateStr != cacheRate) {
    cacheRate = rateStr;
    tft.fillRect(FOCUS_X + 8, 58, 120, 40, C_CARD);
    textAt(rateStr, FOCUS_X + 8, 58, 5, bedIsAlarm(st) ? sc : C_WHITE, C_CARD);
  }

