kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Host-Touch-V_4_9_0/ESP32-S3-Host-Touch-V_4_9_0.ino
  String setStr = (s.cfg.targetRateHr > 0) ? ("SET " + String((int)(s.cfg.targetRateHr + 0.5f))) : String("SET --");
  if (setStr != cacheSetRate) {
    cacheSetRate = setStr;
    textAt("mL/h", FOCUS_X + 132, 80, 1, C_DIM, C_CARD);
    textRight(padTo(setStr, 9), FOCUS_X + FOCUS_W - 8, 62, 1, C_SKY, C_CARD);
  }

  int pct = bedPct(focus);
  if (pct != cachePct) {
    cachePct = pct;
    drawProgressBar(FOCUS_X + 8, 104, FOCUS_W - 16, 10, (pct < 0) ? 0 : pct,
                    (st == BU_NEAREND) ? C_ORANGE : C_CYAN);
  }

  int mins = bedMinutesLeft(focus);
  char tl[16];
  if (mins >= 0) snprintf(tl, sizeof(tl), "%dh %02dm", mins / 60, mins % 60);
  else           snprintf(tl, sizeof(tl), "--h --m");
  char vol[28];
  if (s.cfg.planVolumeMl > 0) snprintf(vol, sizeof(vol), "%d/%d mL", (int)s.totalVolumeMl, (int)s.cfg.planVolumeMl);
  else                        snprintf(vol, sizeof(vol), "%d mL", (int)s.totalVolumeMl);
  String sum = String(vol) + "|" + String(tl);
  if (sum != cacheSummary) {
    cacheSummary = sum;
    tft.fillRect(FOCUS_X + 6, 120, FOCUS_W - 12, 10, C_CARD);
    textAt(String(vol), FOCUS_X + 8, 120, 1, C_DIM, C_CARD);
    textRight(String(tl), FOCUS_X + FOCUS_W - 8, 120, 1, bedIsAlarm(st) ? sc : C_WHITE, C_CARD);
  }
}

void drawHomeRow(int idx, int y, int rowH) {
  BedUiStatus st = bedUiStatus(idx);
  const StationData &s = stations[idx];
  bool dim = (st == BU_OFFLINE);
  uint16_t card = dim ? C_CARD2 : C_CARD;
  uint16_t sc = bedColor(st);

  tft.fillRoundRect(FOCUS_X, y, FOCUS_W, rowH, 5, card);
  tft.fillRect(FOCUS_X, y, 5, rowH, sc);

  char bed[8];
  snprintf(bed, sizeof(bed), "B%02d", idx + 1);
  String rateStr;
  if (st == BU_OFFLINE)     rateStr = "OFF";
  else if (st == BU_PAUSED) rateStr = "||";
  else                      rateStr = String((int)(s.flowRate_ml_hr + 0.5f));

  int ty = y + (rowH - 16) / 2;
  textAt(String(bed), FOCUS_X + 12, ty, 2, dim ? C_DIM : C_WHITE, card);
  String name = String(s.cfg.patientName);
  if (name.length() > 10) name = name.substring(0, 10);
  if (rowH >= 28 && name.length() > 0) textAt(name, FOCUS_X + 56, ty + 4, 1, C_DIM, card);
  textRight(rateStr, FOCUS_X + FOCUS_W - 40, ty, 2, bedIsAlarm(st) ? sc : (dim ? C_DIM : C_WHITE), card);
  textRight(">", FOCUS_X + FOCUS_W - 10, ty, 2, C_DIM, card);
}

void drawHomeList(int focus, bool force) {
  int n = activeStationCount - 1;
  if (n <= 0) return;
  int gap = 4;
  int rowH = (LIST_H - gap * (n - 1)) / n;
  if (rowH > 40) rowH = 40;
  if (rowH < 22) rowH = 22;

  if (force || rowH != homeRowH) {
    homeRowH = rowH;
    tft.fillRect(FOCUS_X, LIST_Y, FOCUS_W, LIST_H, C_BG);
    for (int i = 0; i < MAX_SUPPORTED_STATIONS; i++) cacheSide[i] = "";
  }

  int slot = 0;
  homeRowCount = 0;
  for (int i = 0; i < activeStationCount; i++) {
    if (i == focus) continue;
    int y = LIST_Y + slot * (rowH + gap);
    if (y + rowH > LIST_Y + LIST_H) break;
    homeRowBed[homeRowCount++] = i;
    String key = String((int)bedUiStatus(i)) + ":" + String((int)(stations[i].flowRate_ml_hr + 0.5f));
    if (force || key != cacheSide[i]) {
      cacheSide[i] = key;
      drawHomeRow(i, y, rowH);
    }
    slot++;
  }
}

void drawHomeBottomBar() {
  int alarm = -1, near = -1, online = 0;
  for (int i = 0; i < activeStationCount; i++) {
    if (alarm < 0 && bedIsAlarm(bedUiStatus(i))) alarm = i;
    if (near < 0 && stations[i].alertCode == ALERT_NEAR_END && !stations[i].nearEndAck) near = i;
    if (isStationOnline(i)) online++;
  }
  char buf[40];
  uint16_t bg, fg;
  if (alarm >= 0) {
    snprintf(buf, sizeof(buf), "! BED %02d %s", alarm + 1, alertTextEn(stations[alarm].alertCode));
    bg = C_RED; fg = C_WHITE;
  } else if (near >= 0) {
    snprintf(buf, sizeof(buf), "BED %02d NEXT BAG", near + 1);
    bg = C_ORANGE; fg = C_BG;
  } else {
    snprintf(buf, sizeof(buf), "ALL NORMAL  %d/%d", online, activeStationCount);
    bg = C_CARD; fg = C_GREEN;
  }
  String line = String(buf);
  if (line == cacheBottom) return;
  cacheBottom = line;
  tft.fillRoundRect(ZONE_ALERT.x, ZONE_ALERT.y, ZONE_ALERT.w, ZONE_ALERT.h, 6, bg);
  textCenterIn(line, ZONE_ALERT.x, ZONE_ALERT.w, ZONE_ALERT.y + 10, 1, fg, bg);
}

void drawHomeScreen(bool force) {
  if (force) {
    tft.fillScreen(C_BG);
    drawStatusBar(true);
    drawButton(ZONE_GEAR, "SET", C_BTN, C_WHITE);
    cacheFocusKey = ""; cacheBottom = "";
    for (int i = 0; i < MAX_SUPPORTED_STATIONS; i++) cacheSide[i] = "";
  } else {
    drawStatusBar(false);
  }
  int focus = currentFocusBed();
  drawHomeFocusPanel(focus, force);
  drawHomeList(focus, force);
  drawHomeBottomBar();
}

// จัดการการแตะบนหน้า HOME
void handleHomeTap(int tx, int ty) {
  if (zoneHit(ZONE_GEAR, tx, ty)) {
    uiScreen = SCR_SYS;
    uiNeedFramework = true;
    return;
  }
  if (zoneHit(ZONE_FOCUS, tx, ty)) {
    uiSelectedBed = currentFocusBed();
    uiScreen = SCR_BED;
    uiNeedFramework = true;
    return;
  }
  if (zoneHit(ZONE_ALERT, tx, ty)) {
    int a = autoFocusBed();
    if (a >= 0) {
      uiSelectedBed = a;
      uiScreen = SCR_BED;
      uiNeedFramework = true;
    }
    return;
  }
  if (ty >= LIST_Y && ty < LIST_Y + LIST_H) {
    int gap = 4;
    int slot = (ty - LIST_Y) / (homeRowH + gap);
    if (slot >= 0 && slot < homeRowCount) {
      uiSelectedBed = homeRowBed[slot];
      uiScreen = SCR_BED;
      uiNeedFramework = true;
    }
  }
}

// ============================================================================
// หน้า BED — รายละเอียดเตียงและปุ่มสั่งงาน
// ============================================================================
const TouchZone ZONE_BED_NEWBAG = {   6, 244,  74, 46 };
const TouchZone ZONE_BED_ACK    = {  84, 244,  72, 46 };
const TouchZone ZONE_BED_SET    = { 160, 244,  74, 46 };

void drawBedScreen(bool force) {
  int i = uiSelectedBed;
  BedUiStatus st = bedUiStatus(i);
  const StationData &s = stations[i];
  uint16_t sc = bedColor(st);

  if (force) {
    tft.fillScreen(C_BG);
    drawStatusBar(true);
    char title[16];
    snprintf(title, sizeof(title), "BED %02d", i + 1);
    drawTitleBar(String(title));
    tft.fillRoundRect(6, 62, 228, 100, 8, C_CARD);
    tft.fillRoundRect(6, 168, 228, 64, 8, C_CARD);
    textAt("INFUSED", 14, 176, 1, C_DIM, C_CARD);
    drawButton(ZONE_BED_NEWBAG, "NEW BAG", C_BTN, C_WHITE);
    drawButton(ZONE_BED_ACK, "ACK", C_BTN, C_WHITE);
    drawButton(ZONE_BED_SET, "SET", C_BTN, C_WHITE);
    textCenterIn("tap SET to change target / plan", 0, SCR_W, 300, 1, C_DIM, C_BG);
    cacheBedKey = "";
  } else {
    drawStatusBar(false);
  }

  int pct = bedPct(i);
  int mins = bedMinutesLeft(i);
  String key = String((int)st) + ":" + String((int)(s.flowRate_ml_hr + 0.5f)) + ":" +
               String((int)s.cfg.targetRateHr) + ":" + String(pct) + ":" + String(mins);
  if (key == cacheBedKey) return;
  cacheBedKey = key;

  String name = String(s.cfg.patientName);
  if (name.length() > 14) name = name.substring(0, 14);
  textAt(padTo(name, 14), 14, 70, 1, C_DIM, C_CARD);
  tft.fillRoundRect(146, 66, 82, 20, 5, sc);
  textCenterIn(String(bedWord(st)), 146, 82, 72, 1, C_BG, sc);

  tft.fillRect(12, 90, 140, 48, C_CARD);
  String rateStr = (st == BU_OFFLINE || st == BU_PAUSED) ? String("--")
                                                         : String((int)(s.flowRate_ml_hr + 0.5f));
  textAt(rateStr, 14, 90, 6, bedIsAlarm(st) ? sc : C_WHITE, C_CARD);
  textAt("mL/h", 14, 142, 1, C_DIM, C_CARD);
  textRight(padTo(s.cfg.targetRateHr > 0 ? ("SET " + String((int)s.cfg.targetRateHr) + " mL/h")
                                         : String("SET --"), 14), 226, 142, 1, C_SKY, C_CARD);

  textRight(padTo(pct >= 0 ? (String(pct) + "%") : String("--"), 5), 226, 176, 1, C_WHITE, C_CARD);
  drawProgressBar(14, 190, 212, 12, (pct < 0) ? 0 : pct, (st == BU_NEAREND) ? C_ORANGE : C_CYAN);
  char sub[44];
  if (mins >= 0) snprintf(sub, sizeof(sub), "%d/%d mL   %dh %02dm left",
                          (int)s.totalVolumeMl, (int)s.cfg.planVolumeMl, mins / 60, mins % 60);
  else           snprintf(sub, sizeof(sub), "%d/%d mL   --h --m left",
                          (int)s.totalVolumeMl, (int)s.cfg.planVolumeMl);
  textAt(padTo(String(sub), 30), 14, 212, 1, C_DIM, C_CARD);
}

void handleBedTap(int tx, int ty) {
  if (zoneHit(ZONE_BACK, tx, ty)) {
    uiScreen = SCR_HOME;
    uiNeedFramework = true;
    return;
  }
  if (zoneHit(ZONE_BED_NEWBAG, tx, ty)) {
    // เริ่มถุงใหม่: เปลี่ยน resetSeq ให้เครื่องประจำเตียงล้างตัวนับ (เหมือนปุ่มบนหน้าเว็บ)
    StationData &s = stations[uiSelectedBed];
    s.cfg.resetSeq++;
    s.totalDrops = 0;
    s.lastTotalDrops = 0;
    s.hasBaseline = false;
    s.totalVolumeMl = 0;
    s.nearEndAck = false;
    s.alertCode = ALERT_NONE;
    saveBedConfig(uiSelectedBed);
    sdLogEvent("NEW_BAG", uiSelectedBed, String("counter reset from screen"));
    tone(BUZZER_PIN, 2400, 60);
    uiNeedFramework = true;
    return;
  }
  if (zoneHit(ZONE_BED_ACK, tx, ty)) {
    stations[uiSelectedBed].nearEndAck = true;
    stations[uiSelectedBed].nearNextChime = 0;
    sdLogEvent("ACK_NEAR_END", uiSelectedBed, String("acknowledged on screen"));
    tone(BUZZER_PIN, 2600, 40);
    uiNeedFramework = true;
    return;
  }
  if (zoneHit(ZONE_BED_SET, tx, ty)) {
    const BedConfig &c = stations[uiSelectedBed].cfg;
    editTargetRate  = c.targetRateHr;
    editPlanVolume  = c.planVolumeMl;
    editDropFactor  = safeDropFactor(c.dropFactor);
    editNearPct     = safeNearPct(stations[uiSelectedBed].nearEndPct);
    uiScreen = SCR_BED_SET;
    uiNeedFramework = true;
  }
}

// ============================================================================
// หน้า BED SET — ปรับค่าด้วยปุ่ม - + หรือแตะที่ค่าเพื่อพิมพ์ตัวเลข
// ============================================================================
const int SET_ROW_Y[4] = { 62, 112, 162, 212 };
const TouchZone ZONE_SET_SAVE   = {   6, 266, 111, 46 };
const TouchZone ZONE_SET_CANCEL = { 123, 266, 111, 46 };

void drawSettingRow(int y, const char* label, const String &value, const char* unit, bool force) {
  if (force) {
    tft.fillRoundRect(6, y, 228, 44, 7, C_CARD);
    textAt(String(label), 14, y + 5, 1, C_DIM, C_CARD);
    tft.fillRoundRect(140, y + 4, 44, 36, 6, C_BTN);
    textCenterIn("-", 140, 44, y + 14, 2, C_WHITE, C_BTN);
    tft.fillRoundRect(188, y + 4, 42, 36, 6, C_BTN);
    textCenterIn("+", 188, 42, y + 14, 2, C_WHITE, C_BTN);
  }
  tft.fillRect(12, y + 18, 124, 20, C_CARD);
  textAt(value, 14, y + 20, 2, C_WHITE, C_CARD);
  textAt(String(unit), 14 + (int)value.length() * 12 + 6, y + 26, 1, C_DIM, C_CARD);
}

void drawBedSetScreen(bool force) {
  if (force) {
    tft.fillScreen(C_BG);
    drawStatusBar(true);
    char title[16];
    snprintf(title, sizeof(title), "SET B%02d", uiSelectedBed + 1);
    drawTitleBar(String(title));
    drawButton(ZONE_SET_SAVE, "SAVE", C_GREEN, C_BG, 2);
    drawButton(ZONE_SET_CANCEL, "CANCEL", C_BTN, C_WHITE, 2);
  } else {
    drawStatusBar(false);
  }
  drawSettingRow(SET_ROW_Y[0], "TARGET RATE", String((int)editTargetRate),  "mL/h",   force);
  drawSettingRow(SET_ROW_Y[1], "PLAN VOLUME", String((int)editPlanVolume),  "mL",     force);
  drawSettingRow(SET_ROW_Y[2], "DROP FACTOR", String((int)editDropFactor),  "gtt/mL", force);
  drawSettingRow(SET_ROW_Y[3], "NEXT BAG AT", String((int)editNearPct),     "%",      force);
}

