kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Host-Touch-V_4_9_0/ESP32-S3-Host-Touch-V_4_9_0.ino
// เปิดแป้นตัวเลขสำหรับช่องที่เลือก
void openNumpad(int field) {
  uiEditField = field;
  editNumBuf[0] = '\0';
  switch (field) {
    case 0: editNumLabel = "TARGET RATE"; editNumUnit = "mL/h";   editNumMax = 999; break;
    case 1: editNumLabel = "PLAN VOLUME"; editNumUnit = "mL";     editNumMax = 9999; break;
    case 2: editNumLabel = "DROP FACTOR"; editNumUnit = "gtt/mL"; editNumMax = 60;  break;
    case 3: editNumLabel = "NEXT BAG AT"; editNumUnit = "%";      editNumMax = 95;  break;
    default: editNumLabel = "ACTIVE BEDS"; editNumUnit = "beds";  editNumMax = MAX_SUPPORTED_STATIONS; break;
  }
  uiScreen = SCR_NUMPAD;
  uiNeedFramework = true;
}

void applyEditedValue(int field, int v) {
  switch (field) {
    case 0: editTargetRate = v; break;
    case 1: editPlanVolume = v; break;
    case 2: editDropFactor = safeDropFactor(v); break;
    case 3: editNearPct = safeNearPct(v); break;
    case 4:
      if (v >= 1 && v <= MAX_SUPPORTED_STATIONS) {
        activeStationCount = v;
        preferences.begin("sys-config", false);
        preferences.putUChar("bedCount", activeStationCount);
        preferences.end();
        if (manualFocusBed >= activeStationCount) manualFocusBed = -1;
      }
      break;
  }
}

void stepEditedValue(int field, int dir) {
  switch (field) {
    case 0: editTargetRate += dir * 5;  if (editTargetRate < 0) editTargetRate = 0; if (editTargetRate > 999) editTargetRate = 999; break;
    case 1: editPlanVolume += dir * 50; if (editPlanVolume < 0) editPlanVolume = 0; if (editPlanVolume > 9999) editPlanVolume = 9999; break;
    case 2: {
      const uint8_t df[4] = {10, 15, 20, 60};
      int idx = 2;
      for (int k = 0; k < 4; k++) if (df[k] == editDropFactor) idx = k;
      idx += dir;
      if (idx < 0) idx = 0;
      if (idx > 3) idx = 3;
      editDropFactor = df[idx];
      break;
    }
    case 3: {
      int v = editNearPct + dir * 5;
      if (v < 50) v = 50;
      if (v > 95) v = 95;
      editNearPct = v;
      break;
    }
    case 4: {
      int v = activeStationCount + dir;
      if (v >= 1 && v <= MAX_SUPPORTED_STATIONS) applyEditedValue(4, v);
      break;
    }
  }
}

void handleBedSetTap(int tx, int ty) {
  if (zoneHit(ZONE_BACK, tx, ty) || zoneHit(ZONE_SET_CANCEL, tx, ty)) {
    uiScreen = SCR_BED;
    uiNeedFramework = true;
    return;
  }
  if (zoneHit(ZONE_SET_SAVE, tx, ty)) {
    StationData &s = stations[uiSelectedBed];
    s.cfg.targetRateHr = editTargetRate;
    s.cfg.planVolumeMl = editPlanVolume;
    s.cfg.dropFactor   = editDropFactor;
    s.nearEndPct       = editNearPct;
    s.nearEndAck       = false;              // เปลี่ยนแผนแล้ว เริ่มนับเตือนใกล้หมดใหม่
    saveBedConfig(uiSelectedBed);
    {
      char d[64];
      snprintf(d, sizeof(d), "target %d mL/h  plan %d mL  df %d  near %d%%",
               (int)editTargetRate, (int)editPlanVolume, (int)editDropFactor, (int)editNearPct);
      sdLogEvent("BED_CONFIG", uiSelectedBed, String(d));
    }
    tone(BUZZER_PIN, 2600, 80);
    uiScreen = SCR_BED;
    uiNeedFramework = true;
    return;
  }
  for (int f = 0; f < 4; f++) {
    int y = SET_ROW_Y[f];
    if (ty < y || ty >= y + 44) continue;
    if (tx >= 140 && tx < 184)      stepEditedValue(f, -1);   // ปุ่ม -
    else if (tx >= 188 && tx < 230) stepEditedValue(f, +1);   // ปุ่ม +
    else if (tx < 136)              openNumpad(f);            // แตะที่ค่า = พิมพ์เอง
    return;
  }
}

// ============================================================================
// หน้า NUMPAD — แป้นตัวเลขบนจอ
// ============================================================================
void drawNumpadScreen(bool force) {
  if (force) {
    tft.fillScreen(C_BG);
    drawStatusBar(true);
    drawTitleBar("ENTER");
    tft.fillRoundRect(6, 62, 228, 46, 7, C_CARD);
    textAt(String(editNumLabel), 14, 68, 1, C_DIM, C_CARD);
    textRight(String(editNumUnit), 226, 88, 1, C_DIM, C_CARD);

    const char* keys[12] = { "1","2","3","4","5","6","7","8","9","C","0","OK" };
    for (int i = 0; i < 12; i++) {
      int col = i % 3, row = i / 3;
      TouchZone z = { 6 + col * 78, 116 + row * 50, 72, 44 };
      bool ok = (i == 11), clr = (i == 9);
      drawButton(z, String(keys[i]), ok ? C_GREEN : (clr ? C_ORANGE : C_BTN),
                 (ok || clr) ? C_BG : C_WHITE, 2);
    }
    cacheNumValue = "";
  } else {
    drawStatusBar(false);
  }
  String v = (editNumBuf[0] == '\0') ? String("_") : String(editNumBuf);
  if (v != cacheNumValue) {
    cacheNumValue = v;
    tft.fillRect(12, 80, 120, 24, C_CARD);
    textAt(v, 14, 82, 3, C_WHITE, C_CARD);
  }
}

void handleNumpadTap(int tx, int ty) {
  if (zoneHit(ZONE_BACK, tx, ty)) {
    uiScreen = (uiEditField == 4) ? SCR_SYS : SCR_BED_SET;
    uiNeedFramework = true;
    return;
  }
  for (int i = 0; i < 12; i++) {
    int col = i % 3, row = i / 3;
    TouchZone z = { 6 + col * 78, 116 + row * 50, 72, 44 };
    if (!zoneHit(z, tx, ty)) continue;
    if (i == 9) {                                   // ปุ่ม C = ล้าง
      editNumBuf[0] = '\0';
    } else if (i == 11) {                           // ปุ่ม OK = ยืนยัน
      if (editNumBuf[0] != '\0') {
        int v = atoi(editNumBuf);
        if (v > editNumMax) v = editNumMax;
        applyEditedValue(uiEditField, v);
      }
      uiScreen = (uiEditField == 4) ? SCR_SYS : SCR_BED_SET;
      uiNeedFramework = true;
      tone(BUZZER_PIN, 2600, 40);
      return;
    } else {
      size_t len = strlen(editNumBuf);
      if (len < sizeof(editNumBuf) - 1) {
        editNumBuf[len] = (i == 10) ? '0' : (char)('1' + i);
        editNumBuf[len + 1] = '\0';
      }
    }
    tone(BUZZER_PIN, 3000, 10);
    return;
  }
}

// ============================================================================
// หน้า SYSTEM — ตั้งค่าระบบ (ทุกค่ายังแก้จากหน้าเว็บได้เหมือนเดิม)
// ============================================================================
const TouchZone ZONE_SYS_CALIB = { 6, 162, 228, 40 };

void drawSysScreen(bool force) {
  if (force) {
    tft.fillScreen(C_BG);
    drawStatusBar(true);
    drawTitleBar("SETTINGS");
    drawButton(ZONE_SYS_CALIB, "TOUCH CALIBRATION", C_BTN, C_WHITE);

    tft.fillRoundRect(6, 204, 228, 112, 7, C_CARD);
    textAt("WI-FI / WEB", 14, 210, 1, C_DIM, C_CARD);
    textRight("v" APP_VERSION, 226, 210, 1, C_DIM, C_CARD);
    textAt(String(default_ap_ssid), 14, 224, 1, C_WHITE, C_CARD);
    textAt("pass " + String(default_ap_pass), 14, 238, 1, C_DIM, C_CARD);
    textAt("http://" + WiFi.softAPIP().toString(), 14, 252, 1, C_SKY, C_CARD);
    tft.drawFastHLine(14, 267, 212, C_DIM);
    textAt("CLOCK / SD CARD", 14, 274, 1, C_DIM, C_CARD);
    cacheSummary = "";
  } else {
    drawStatusBar(false);
  }

  drawSettingRow(62,  "ACTIVE BEDS",       String(activeStationCount), "beds", force);
  drawSettingRow(112, "SCREEN BRIGHTNESS", String(screenBrightness),   "%",    force);

  // แถวสถานะแบบเปลี่ยนแปลงได้: จำนวนอุปกรณ์ที่ต่ออยู่ + สถานะนาฬิกา DS3231 + SD card
  String devTxt = String((int)WiFi.softAPgetStationNum()) + " dev";
  String rtcTxt = rtcStatusText();
  String sdTxt  = sdStatusText();
  String key = devTxt + "|" + rtcTxt + "|" + sdTxt;
  if (key != cacheSummary) {
    cacheSummary = key;
    textRight(padTo(devTxt, 8), 226, 224, 1, C_DIM, C_CARD);
    textAt(padTo("RTC " + rtcTxt, 24), 14, 288, 1,
           (rtcPresent && rtcTimeOk) ? C_GREEN : C_YELLOW, C_CARD);
    textAt(padTo("SD  " + sdTxt, 24), 14, 302, 1,
           sdPresent ? C_GREEN : C_YELLOW, C_CARD);
  }
}

void handleSysTap(int tx, int ty) {
  if (zoneHit(ZONE_BACK, tx, ty)) {
    uiScreen = SCR_HOME;
    uiNeedFramework = true;
    return;
  }
  if (zoneHit(ZONE_SYS_CALIB, tx, ty)) {
    uiScreen = SCR_CALIB;
    uiNeedFramework = true;
    return;
  }
  if (ty >= 62 && ty < 106) {                        // แถวจำนวนเตียง
    if (tx >= 140 && tx < 184)      stepEditedValue(4, -1);
    else if (tx >= 188 && tx < 230) stepEditedValue(4, +1);
    else if (tx < 136)              openNumpad(4);
    return;
  }
  if (ty >= 112 && ty < 156) {                       // แถวความสว่างหน้าจอ
    if (tx >= 140 && tx < 184)      setScreenBrightness(screenBrightness - 25);
    else if (tx >= 188 && tx < 230) setScreenBrightness(screenBrightness + 25);
    return;
  }
}

// ============================================================================
// หน้า ALARM — เตือนเต็มจอ แตะที่ไหนก็ได้เพื่อพักเสียง 2 นาที
// ============================================================================
void drawAlarmScreen(bool force) {
  int bed = autoFocusBed();
  if (bed < 0) bed = 0;
  const StationData &s = stations[bed];
  uint8_t code = s.alertCode;

  if (force) {
    tft.fillScreen(C_RED);
    tft.fillRoundRect(10, 14, 220, 44, 8, C_WHITE);
    char head[16];
    snprintf(head, sizeof(head), "BED %02d", bed + 1);
    textCenterIn(String(head), 10, 220, 28, 3, C_RED, C_WHITE);

    const char* sub = "CHECK IV SYSTEM";
    if (code == ALERT_OCCLUSION)     sub = "LINE BLOCKED - CHECK TUBING";
    else if (code == ALERT_TOO_FAST) sub = "FLOW ABOVE TARGET";
    else if (code == ALERT_TOO_SLOW) sub = "FLOW BELOW TARGET";
    else if (code == ALERT_COMPLETE) sub = "INFUSION FINISHED";
    textCenterIn(String(alertTextEn(code)), 0, SCR_W, 74, 3, C_WHITE, C_RED);
    textCenterIn(String(sub), 0, SCR_W, 112, 1, C_YELLOW, C_RED);

    tft.fillRoundRect(16, 136, 208, 80, 8, C_BG);
    textAt("RATE", 28, 144, 1, C_DIM, C_BG);
    textAt("mL/h", 28, 196, 1, C_DIM, C_BG);
    textRight(s.cfg.targetRateHr > 0 ? ("SET " + String((int)s.cfg.targetRateHr) + " mL/h") : String("SET --"),
              212, 196, 1, C_SKY, C_BG);

    tft.fillRoundRect(16, 232, 208, 72, 10, C_WHITE);
    textCenterIn("TAP = SNOOZE 2 MIN", 16, 208, 252, 1, C_RED, C_WHITE);
    textCenterIn("BUTTON = SILENCE", 16, 208, 274, 1, C_RED, C_WHITE);
    cacheAlarmRate = "";
  }

  String rate = String((int)(s.flowRate_ml_hr + 0.5f));
  if (rate != cacheAlarmRate) {
    cacheAlarmRate = rate;
    tft.fillRect(26, 158, 150, 34, C_BG);
    textAt(rate, 28, 158, 4, C_WHITE, C_BG);
  }
}

void handleAlarmTap(int tx, int ty) {
  (void)tx; (void)ty;                       // แตะที่ไหนก็ได้ = พักเสียง
  globalSnoozeUntil = millis() + SNOOZE_MS;
  noTone(BUZZER_PIN);
  tone(BUZZER_PIN, 2200, 40);
  uiScreen = SCR_HOME;
  uiNeedFramework = true;
}

// ============================================================================
// หน้า CALIB — ปรับความแม่นของจอสัมผัส (แตะกากบาท 2 จุด)
// ============================================================================
int calibStep = 0;
int calibRawX[2], calibRawY[2];
const int CALIB_PT[2][2] = { { 24, 40 }, { SCR_W - 24, SCR_H - 40 } };

