kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Host-Touch-V_4_9_0/ESP32-S3-Host-Touch-V_4_9_0.ino
void drawCalibCross(int x, int y, uint16_t col) {
  tft.drawFastHLine(x - 12, y, 25, col);
  tft.drawFastVLine(x, y - 12, 25, col);
  tft.drawCircle(x, y, 8, col);
}

void drawCalibScreen(bool force) {
  if (!force) return;
  tft.fillScreen(C_BG);
  textCenterIn("TOUCH CALIBRATION", 0, SCR_W, 120, 2, C_WHITE, C_BG);
  textCenterIn(calibStep == 0 ? "tap the cross (1 of 2)" : "tap the cross (2 of 2)",
               0, SCR_W, 150, 1, C_DIM, C_BG);
  textCenterIn("use a stylus for best accuracy", 0, SCR_W, 170, 1, C_DIM, C_BG);
  drawCalibCross(CALIB_PT[calibStep][0], CALIB_PT[calibStep][1], C_YELLOW);
}

// หน้านี้อ่านค่าดิบเอง ไม่ผ่าน mapTouch เพราะกำลังหาค่าปรับอยู่
void serviceCalibScreen() {
  if (!ts.touched()) { touchWasDown = false; return; }
  if (touchWasDown) return;
  TS_Point p = ts.getPoint();
  if (p.z < TOUCH_MIN_PRESSURE) return;
  touchWasDown = true;
  lastUserActivityTime = millis();

  calibRawX[calibStep] = p.x;
  calibRawY[calibStep] = p.y;
  tone(BUZZER_PIN, 2600, 40);
  calibStep++;

  if (calibStep < 2) {
    uiNeedFramework = true;
    return;
  }

  // คำนวณค่าดิบที่ขอบจอจากจุดที่แตะสองจุด (เชิงเส้น)
  int dxScreen = CALIB_PT[1][0] - CALIB_PT[0][0];
  int dyScreen = CALIB_PT[1][1] - CALIB_PT[0][1];
  if (dxScreen != 0 && dyScreen != 0) {
    long slopeX = ((long)(calibRawX[1] - calibRawX[0]) * 1000) / dxScreen;
    long slopeY = ((long)(calibRawY[1] - calibRawY[0]) * 1000) / dyScreen;
    touchRawX0 = calibRawX[0] - (int)((slopeX * CALIB_PT[0][0]) / 1000);
    touchRawX1 = touchRawX0 + (int)((slopeX * (SCR_W - 1)) / 1000);
    touchRawY0 = calibRawY[0] - (int)((slopeY * CALIB_PT[0][1]) / 1000);
    touchRawY1 = touchRawY0 + (int)((slopeY * (SCR_H - 1)) / 1000);
    saveTouchCalibration();
  }

  calibStep = 0;
  tft.fillScreen(C_BG);
  textCenterIn("CALIBRATION SAVED", 0, SCR_W, 140, 2, C_GREEN, C_BG);
  delay(900);
  uiScreen = SCR_SYS;
  uiNeedFramework = true;
}

// ============================================================================
// ตัวควบคุมการแสดงผลและการแตะทั้งหมด
// ============================================================================
void resetUiCaches() {
  cacheClock = ""; cacheTopRight = ""; cacheFocusKey = ""; cacheStatusWord = "";
  cacheRate = ""; cacheSetRate = ""; cacheSummary = ""; cacheBottom = "";
  cacheBedKey = ""; cacheAlarmRate = ""; cacheNumValue = "";
  cachePct = -999;
  for (int i = 0; i < MAX_SUPPORTED_STATIONS; i++) cacheSide[i] = "";
}

void updateHostDisplay() {
  if (displaySleeping || isPowerOffProgressActive) return;

  // เหตุวิกฤตที่ยังไม่พักเสียง -> บังคับขึ้นจอเตือนเต็มจอ (ยกเว้นระหว่างปรับจอสัมผัส)
  bool alarmNow = globalAlarmTriggered && !isSnoozed();
  if (alarmNow && uiScreen != SCR_ALARM && uiScreen != SCR_CALIB) {
    uiScreen = SCR_ALARM;
    uiNeedFramework = true;
  } else if (!alarmNow && uiScreen == SCR_ALARM) {
    uiScreen = SCR_HOME;
    uiNeedFramework = true;
  }

  bool force = uiNeedFramework || (uiScreen != uiScreenDrawn);
  if (force) {
    resetUiCaches();
    uiScreenDrawn = uiScreen;
    uiNeedFramework = false;
  }

  switch (uiScreen) {
    case SCR_HOME:    drawHomeScreen(force);   break;
    case SCR_BED:     drawBedScreen(force);    break;
    case SCR_BED_SET: drawBedSetScreen(force); break;
    case SCR_NUMPAD:  drawNumpadScreen(force); break;
    case SCR_SYS:     drawSysScreen(force);    break;
    case SCR_ALARM:   drawAlarmScreen(force);  break;
    case SCR_CALIB:   drawCalibScreen(force);  break;
    default: break;
  }
}

// เรียกทุกรอบ loop เพื่ออ่านการแตะและส่งให้หน้าที่กำลังแสดงอยู่
void serviceTouch() {
  if (isPowerOffProgressActive) return;
  if (uiScreen == SCR_CALIB) { serviceCalibScreen(); return; }

  int tx, ty;
  if (!readTap(tx, ty)) return;

  if (displaySleeping) {                 // จอดับอยู่: แตะหนึ่งครั้งเพื่อปลุก
    setDisplaySleep(false);
    return;
  }

  switch (uiScreen) {
    case SCR_HOME:    handleHomeTap(tx, ty);   break;
    case SCR_BED:     handleBedTap(tx, ty);    break;
    case SCR_BED_SET: handleBedSetTap(tx, ty); break;
    case SCR_NUMPAD:  handleNumpadTap(tx, ty); break;
    case SCR_SYS:     handleSysTap(tx, ty);    break;
    case SCR_ALARM:   handleAlarmTap(tx, ty);  break;
    default: break;
  }
  if (uiNeedFramework) updateHostDisplay();    // ตอบสนองทันทีที่แตะ ไม่ต้องรอรอบวาดถัดไป
}

// ย้อนกลับหนึ่งขั้น (ใช้กับปุ่ม multifunction)
void uiGoBack() {
  switch (uiScreen) {
    case SCR_BED:     uiScreen = SCR_HOME;    break;
    case SCR_BED_SET: uiScreen = SCR_BED;     break;
    case SCR_NUMPAD:  uiScreen = (uiEditField == 4) ? SCR_SYS : SCR_BED_SET; break;
    case SCR_SYS:     uiScreen = SCR_HOME;    break;
    case SCR_CALIB:   uiScreen = SCR_SYS; calibStep = 0; break;
    default:          uiScreen = SCR_HOME;    break;
  }
  uiNeedFramework = true;
}

// ---- หน้าจอเฉพาะกิจ: ปิดเครื่อง / หน้าจอต้อนรับ ----
void drawPowerOffProgress(int pct) {
  if (uiScreenDrawn != SCR_POWER) {
    uiScreenDrawn = SCR_POWER;
    tft.fillScreen(C_BG);
    textCenterIn("POWER OFF ?", 0, SCR_W, 110, 3, C_WHITE, C_BG);
    textCenterIn("KEEP HOLDING TO TURN OFF", 0, SCR_W, 150, 1, C_DIM, C_BG);
    tft.drawRoundRect(18, 178, 204, 24, 6, C_WHITE);
  }
  if (pct < 0) pct = 0;
  if (pct > 100) pct = 100;
  int w = (200 * pct) / 100;
  tft.fillRect(20, 180, w, 20, C_RED);
  tft.fillRect(20 + w, 180, 200 - w, 20, C_BG);
}

void drawGoodbyeScreen() {
  uiScreenDrawn = SCR_POWER;
  tft.fillScreen(C_BG);
  textCenterIn("GOODBYE", 0, SCR_W, 120, 4, C_SKY, C_BG);
  textCenterIn("RELEASE BUTTON TO TURN OFF", 0, SCR_W, 170, 1, C_DIM, C_BG);
  textCenterIn("HOLD 2s TO POWER ON AGAIN", 0, SCR_W, 190, 1, C_DIM, C_BG);
}

void setDisplaySleep(bool sleep) {
  displaySleeping = sleep;
  if (sleep) {
    setBacklightRaw(0);
    tft.fillScreen(C_BG);
  } else {
    setBacklightRaw(screenBrightness);
    uiScreenDrawn = (UiScreen)-1;
    uiNeedFramework = true;
    resetUiCaches();
  }
}

void drawSplashScreen() {
  tft.fillScreen(C_BG);
  tft.fillRoundRect(20, 70, 200, 96, 10, C_TOPBAR);
  textCenterIn("SMART IV", 0, SCR_W, 88, 4, C_WHITE, C_TOPBAR);
  textCenterIn("CENTRAL HOST", 0, SCR_W, 130, 2, C_SKY, C_TOPBAR);
  textCenterIn("Host v" APP_VERSION, 0, SCR_W, 188, 1, C_DIM, C_BG);
  char buf[40];
  snprintf(buf, sizeof(buf), "BEDS %d   TOUCH SCREEN", activeStationCount);
  textCenterIn(String(buf), 0, SCR_W, 208, 1, C_DIM, C_BG);
  textCenterIn(String(default_ap_ssid), 0, SCR_W, 232, 1, C_WHITE, C_BG);
  textCenterIn("BCN Phrae Innovation", 0, SCR_W, 258, 1, C_GREEN, C_BG);
}

// ----------------------------------------------------------------------------
// REST APIs & Handlers
// ----------------------------------------------------------------------------
void handleApiData() {
  if (!server.authenticate(web_username, web_password)) return server.requestAuthentication();
  String json;
  json.reserve(3000);
  json = "{";
  json += "\"version\":\"" APP_VERSION "\",";
  json += "\"activeCount\":" + String(activeStationCount) + ",";
  json += "\"currentTime\":\"" + getFormattedDateTime() + "\",";
  json += "\"timeSynced\":" + String(isTimeSynced ? "true" : "false") + ",";
  json += "\"timeApprox\":" + String(isTimeApprox ? "true" : "false") + ",";
  json += "\"apClients\":" + String(WiFi.softAPgetStationNum()) + ",";
  json += "\"apMaxClients\":" + String(AP_MAX_CLIENTS) + ",";
  json += "\"channel\":" + String(currentWifiChannel()) + ",";
  json += "\"hostBatVolts\":" + String(hostBatteryVolts, 2) + ",";
  json += "\"hostBatPct\":" + String(hostBatteryPct) + ",";
  json += "\"snoozed\":" + String(isSnoozed() ? "true" : "false") + ",";
  json += "\"rtc\":\"" + jsonEscape(rtcStatusText().c_str()) + "\",";
  json += "\"sd\":\"" + jsonEscape(sdStatusText().c_str()) + "\",";
  json += "\"sdRows\":" + String(sdRowsWritten) + ",";
  json += "\"stations\":[";
  for (int i = 0; i < activeStationCount; i++) {
    const StationData &s = stations[i];
    bool isOnline = isStationOnline(i);
    if (i > 0) json += ",";
    json += "{";
    json += "\"id\":" + String(i + 1) + ",";
    json += "\"online\":" + String(isOnline ? "true" : "false") + ",";
    json += "\"running\":" + String(s.isRunning ? "true" : "false") + ",";
    json += "\"rssi\":" + String(isOnline ? s.rssi : 0) + ",";
    json += "\"battery\":" + String(s.batteryVolts, 2) + ",";
    json += "\"totalDrops\":" + String(s.totalDrops) + ",";
    json += "\"volumeMl\":" + String(s.totalVolumeMl, 2) + ",";
    json += "\"flowRateHr\":" + String(s.flowRate_ml_hr, 2) + ",";
    json += "\"msSinceLastDrop\":" + String(s.msSinceLastDrop) + ",";
    json += "\"targetRate\":" + String(s.cfg.targetRateHr, 1) + ",";
    json += "\"planVolume\":" + String(s.cfg.planVolumeMl, 0) + ",";
    json += "\"dropFactor\":" + String(safeDropFactor(s.cfg.dropFactor)) + ",";
    json += "\"patientName\":\"" + jsonEscape(s.cfg.patientName) + "\",";
    json += "\"alertCode\":" + String(s.alertCode) + ",";
    json += "\"nearEndPct\":" + String(safeNearPct(s.nearEndPct)) + ",";
    json += "\"nearEndAck\":" + String(s.nearEndAck ? "true" : "false") + ",";
    json += "\"caseActive\":" + String(s.trialCase.active ? "true" : "false") + ",";
    json += "\"caseStart\":\"" + String(s.trialCase.startTimeStr) + "\"";
    json += "}";
  }
  json += "]}";
  server.send(200, "application/json", json);
}

int parseStationArg() {
  if (!server.hasArg("station")) return -1;
  int st = server.arg("station").toInt();
  if (st < 1 || st > MAX_SUPPORTED_STATIONS) return -1;
  return st - 1;
}

// POST /api/stations/config  station, rate, volume, df, name (ส่งเฉพาะที่ต้องการเปลี่ยน)
void handleStationConfig() {
  if (!server.authenticate(web_username, web_password)) return server.requestAuthentication();
  int idx = parseStationArg();
  if (idx < 0) { server.send(400, "text/plain", "Invalid station"); return; }

