kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Host-Touch-V_4_9_0/ESP32-S3-Host-Touch-V_4_9_0.ino
  String filename = "IV_Report_Bed_" + String(st) + ".csv";
  server.sendHeader("Content-Disposition", "attachment; filename=" + filename);
  server.send(200, "text/csv; charset=utf-8", csv);
}

// ----------------------------------------------------------------------------
// ไฟล์บันทึกบน SD card — รายการไฟล์ และดาวน์โหลดผ่านหน้าเว็บ
// ----------------------------------------------------------------------------

// อนุญาตเฉพาะชื่อไฟล์ธรรมดาในโฟลเดอร์ /IVLOG (กันการอ่านไฟล์นอกโฟลเดอร์)
bool sdSafeName(const String &name) {
  if (name.length() == 0 || name.length() > 40) return false;
  for (unsigned int i = 0; i < name.length(); i++) {
    char c = name.c_str()[i];
    bool ok = (c >= 'a' && c <= 'z') || (c >= 'A' && c <= 'Z') ||
              (c >= '0' && c <= '9') || c == '_' || c == '-' || c == '.';
    if (!ok) return false;
  }
  if (name == "." || name == "..") return false;
  return true;
}

// GET /api/sd/list -> { "present":true, "rows":123, "files":[{"name":"...","size":123}] }
void handleSdList() {
  if (!server.authenticate(web_username, web_password)) return server.requestAuthentication();
  String json = "{\"present\":";
  json += sdPresent ? "true" : "false";
  json += ",\"rows\":" + String(sdRowsWritten);
  json += ",\"files\":[";
  if (sdPresent) {
    File dir = SD.open("/IVLOG");
    if (dir && dir.isDirectory()) {
      bool first = true;
      File f = dir.openNextFile();
      while (f) {
        if (!f.isDirectory()) {
          String nm = String(f.name());
          int slash = -1;
          for (unsigned int i = 0; i < nm.length(); i++) if (nm.c_str()[i] == '/') slash = (int)i;
          if (slash >= 0) nm = nm.substring(slash + 1);
          if (!first) json += ",";
          first = false;
          json += "{\"name\":\"" + jsonEscape(nm.c_str()) + "\",\"size\":" + String((unsigned long)f.size()) + "}";
        }
        f.close();
        f = dir.openNextFile();
      }
    }
    if (dir) dir.close();
  }
  json += "]}";
  server.send(200, "application/json", json);
}

// GET /api/sd/download?file=20260916_data.csv
void handleSdDownload() {
  if (!server.authenticate(web_username, web_password)) return server.requestAuthentication();
  if (!sdPresent) { server.send(503, "text/plain", "No SD card"); return; }
  if (!server.hasArg("file")) { server.send(400, "text/plain", "Missing file"); return; }
  String name = server.arg("file");
  if (!sdSafeName(name)) { server.send(400, "text/plain", "Bad file name"); return; }
  String path = "/IVLOG/" + name;
  if (!SD.exists(path)) { server.send(404, "text/plain", "Not found"); return; }
  File f = SD.open(path, FILE_READ);
  if (!f) { server.send(500, "text/plain", "Open failed"); return; }
  server.sendHeader("Content-Disposition", "attachment; filename=" + name);
  server.streamFile(f, "text/csv; charset=utf-8");
  f.close();
}

// ----------------------------------------------------------------------------
// ข้อมูลจุดเชื่อมต่อ (อ่านอย่างเดียว) และการตั้งเวลาจากเครื่องของผู้ใช้
// ----------------------------------------------------------------------------
void handleApStatus() {
  if (!server.authenticate(web_username, web_password)) return server.requestAuthentication();
  String json = "{";
  json += "\"ssid\":\"" + jsonEscape(default_ap_ssid) + "\",";
  json += "\"password\":\"" + jsonEscape(default_ap_pass) + "\",";
  json += "\"apIP\":\"" + WiFi.softAPIP().toString() + "\",";
  json += "\"channel\":" + String(currentWifiChannel()) + ",";
  json += "\"clients\":" + String(WiFi.softAPgetStationNum()) + ",";
  json += "\"maxClients\":" + String(AP_MAX_CLIENTS) + ",";
  json += "\"currentTime\":\"" + getFormattedDateTime() + "\",";
  json += "\"timeSynced\":" + String(isTimeSynced ? "true" : "false") + ",";
  json += "\"timeApprox\":" + String(isTimeApprox ? "true" : "false");
  json += "}";
  server.send(200, "application/json", json);
}

// หน้าเว็บส่งเวลาของเครื่องที่เปิดดู (epoch UTC) มาตั้งให้ Host แทนการใช้ NTP
void handleTimeSet() {
  if (!server.authenticate(web_username, web_password)) return server.requestAuthentication();
  if (!server.hasArg("epoch")) {
    server.send(400, "text/plain", "Missing epoch");
    return;
  }
  uint32_t epoch = (uint32_t)strtoul(server.arg("epoch").c_str(), NULL, 10);
  if (epoch < 1600000000UL) {
    server.send(400, "text/plain", "Bad epoch");
    return;
  }
  struct timeval tv = { (time_t)epoch, 0 };
  settimeofday(&tv, NULL);
  isTimeSynced = true;
  isTimeApprox = false;
  syncRtcFromSystem();                 // เก็บลง DS3231 ให้เวลาคงอยู่แม้ไฟดับ
  backupClockToNvs();
  lastTimeBackup = millis();
  sdLogEvent("TIME_SET", -1, getFormattedDateTime());
  server.send(200, "text/plain", getFormattedDateTime().c_str());
}

// ----------------------------------------------------------------------------
// หน้าเว็บ Dashboard (HTML/CSS/JavaScript) แยกไว้ในไฟล์ web_dashboard.h
// ไฟล์นั้นนิยามตัวแปร PAGE_INDEX ที่ handleRoot() ส่งให้เบราว์เซอร์
// ----------------------------------------------------------------------------
#include "web_dashboard.h"

void handleRoot() {
  if (!server.authenticate(web_username, web_password)) {
    return server.requestAuthentication();
  }
  server.send_P(200, "text/html", PAGE_INDEX);
}

// ==========================================
//  Setup & Initialization
// ==========================================
void setup() {
  Serial.begin(115200);

  rtc_gpio_deinit((gpio_num_t)POWER_BTN_PIN);   // คืนขาจากโหมด RTC หลังตื่นจาก deep sleep
  pinMode(POWER_BTN_PIN, INPUT_PULLUP);
  esp_sleep_wakeup_cause_t wakeup_reason = esp_sleep_get_wakeup_cause();

  if (wakeup_reason == ESP_SLEEP_WAKEUP_EXT0 || wakeup_reason == ESP_SLEEP_WAKEUP_GPIO) {
    unsigned long pressStart = millis();
    bool validHoldToTurnOn = false;

    while (digitalRead(POWER_BTN_PIN) == LOW) {
      if (millis() - pressStart >= 1500) {
        validHoldToTurnOn = true;
        break;
      }
      delay(10);
    }

    if (!validHoldToTurnOn) {
      while (digitalRead(POWER_BTN_PIN) == LOW) delay(10);
      delay(100);
      enterDeepSleepWaitPowerButton();
    }

    while (digitalRead(POWER_BTN_PIN) == LOW) delay(10);
    delay(150);
  }

  analogReadResolution(12);
  analogSetAttenuation(ADC_11db);
  pinMode(HOST_BAT_ADC_PIN, INPUT);

  pinMode(BUZZER_PIN, OUTPUT);
  digitalWrite(BUZZER_PIN, LOW);

#if TFT_BLK >= 0
  #if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
    ledcAttach(TFT_BLK, 5000, 8);        // ไฟหน้าจอควบคุมด้วย PWM เพื่อปรับความสว่างได้
  #else
    ledcSetup(0, 5000, 8);
    ledcAttachPin(TFT_BLK, 0);
  #endif
#endif
  SPI_TFT.begin(TFT_SCLK, TFT_MISO, TFT_MOSI, TFT_CS);   // MISO จำเป็นสำหรับอ่านค่าทัช
  tft.init(240, 320);              // ความละเอียดจริงของแผง
  tft.setSPISpeed(40000000);
  tft.setRotation(TFT_ROTATION);   // 0 = แนวตั้ง 240x320
  tft.setTextWrap(false);
  tft.fillScreen(0x0000);

  ts.begin(SPI_TFT);               // ทัชใช้บัส SPI เดียวกับจอ
  ts.setRotation(TFT_ROTATION);
  loadTouchCalibration();

  hostBatteryVolts = readHostBattery();
  hostBatteryPct = calculateBatteryPct(hostBatteryVolts);

