kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Host-Touch-V_4_9_0/ESP32-S3-Host-Touch-V_4_9_0.ino
  preferences.begin("sys-config", true);
  activeStationCount = preferences.getUChar("bedCount", 5);
  screenBrightness   = preferences.getUChar("bright", 100);
  uint32_t savedEpoch = preferences.getUInt("lastEpoch", 0);
  preferences.end();
  if (screenBrightness < 25 || screenBrightness > 100) screenBrightness = 100;
  setBacklightRaw(screenBrightness);

  // เขตเวลาไทยถาวร
  setenv("TZ", TZ_THAILAND, 1);
  tzset();

  // ลำดับแหล่งเวลา: DS3231 (แม่นที่สุด) -> ค่าที่สำรองไว้ใน NVS -> รอหน้าเว็บส่งเวลามาให้
  initRtc();
  if (!isTimeSynced && savedEpoch > 1600000000UL) {
    struct timeval tv = { (time_t)savedEpoch, 0 };
    settimeofday(&tv, NULL);
    isTimeApprox = true;
  }

  initSdCard();
  for (int i = 0; i < MAX_SUPPORTED_STATIONS; i++) lastLoggedAlert[i] = ALERT_NONE;
  sdLogEvent("BOOT", -1, String("Host v" APP_VERSION " started"));
  if (activeStationCount < 1 || activeStationCount > MAX_SUPPORTED_STATIONS) activeStationCount = 5;

  loadBedConfigs();

  // ---------------- Wi-Fi: Access Point อย่างเดียว (ไม่ต่อ Router / ไม่ใช้อินเทอร์เน็ต) ----------------
  // โหมด AP ล้วนทำให้ช่องสัญญาณนิ่ง ESP-NOW ไม่หลุด และรองรับผู้ใช้พร้อมกันได้หลายเครื่อง
  WiFi.persistent(false);
  WiFi.mode(WIFI_AP);
  WiFi.softAP(default_ap_ssid, default_ap_pass, ESPNOW_CHANNEL, 0, AP_MAX_CLIENTS);
  WiFi.setSleep(false);
  esp_wifi_set_ps(WIFI_PS_NONE);   // ไม่ประหยัดพลังงาน = ตอบสนองหลายเครื่องพร้อมกันได้นิ่ง

  // ล้างรหัส Wi-Fi ของ Router ที่เคยบันทึกไว้ในเฟิร์มแวร์รุ่นก่อน (ไม่ใช้แล้ว) ครั้งเดียว
  preferences.begin("wifi-config", false);
  if (preferences.isKey("ssid")) preferences.clear();
  preferences.end();

  Serial.printf("[HOST] SoftAP ready, channel = %d, max clients = %d\n", currentWifiChannel(), AP_MAX_CLIENTS);

  MDNS.begin("iv-monitor");

  // ---------------- ESP-NOW ----------------
  if (esp_now_init() != ESP_OK) {
    Serial.println("[HOST] ESP-NOW init FAILED");
  } else {
    esp_now_register_recv_cb(esp_now_recv_cb_t(OnDataRecv));

    esp_now_peer_info_t peerInfo = {};
    memcpy(peerInfo.peer_addr, broadcastAddress, 6);
    peerInfo.channel = 0;            // 0 = ใช้ช่องปัจจุบันของอินเทอร์เฟซ
    peerInfo.ifidx   = WIFI_IF_AP;    // ไม่มี STA แล้ว จึงส่งผ่านอินเทอร์เฟซ AP
    peerInfo.encrypt = false;
    esp_now_add_peer(&peerInfo);
  }

  server.on("/", handleRoot);
  server.on("/api/data", handleApiData);
  server.on("/api/stations/set", HTTP_POST, handleSetStationCount);
  server.on("/api/stations/config", HTTP_POST, handleStationConfig);
  server.on("/api/stations/reset", HTTP_POST, handleStationReset);
  server.on("/api/stations/ack", HTTP_POST, handleStationAck);
  server.on("/api/logs", handleApiLogs);
  server.on("/api/logs/csv", handleDownloadCSV);
  server.on("/api/ap/status", handleApStatus);
  server.on("/api/time/set", HTTP_POST, handleTimeSet);
  server.on("/api/sd/list", handleSdList);
  server.on("/api/sd/download", handleSdDownload);
  server.begin();

  drawSplashScreen();
  lastUserActivityTime = millis();
  playWelcomeMelody();
  delay(1400);
  uiScreen = touchCalibrated ? SCR_HOME : SCR_CALIB;   // ยังไม่เคยปรับจอสัมผัส -> ปรับก่อนใช้งาน
  uiScreenDrawn = (UiScreen)-1;
  uiNeedFramework = true;

  unsigned long nowMs = millis();
  lastCalcTime = nowMs;
  lastMinuteLogTime = nowMs;
  lastSyncBroadcastTime = nowMs;
  updateHostDisplay();
}

// ==========================================
//  Main Execution Loop
// ==========================================
void loop() {
  server.handleClient();

  checkMultifunctionButton();
  serviceTouch();                 // อ่านการแตะหน้าจอทุกรอบ เพื่อให้ตอบสนองทันที
  handleBuzzerAlarm();

  unsigned long currentMillis = millis();

  // สำรองเวลาลง NVS เป็นระยะ เพื่อให้เวลายังใกล้เคียงเดิมหลังไฟดับ
  if (currentMillis - lastTimeBackup >= TIME_BACKUP_INTERVAL_MS) {
    lastTimeBackup = currentMillis;
    backupClockToNvs();
  }
  serviceRtc(currentMillis);           // ปรับเวลาระบบตาม DS3231 ทุก 1 ชั่วโมง
  serviceSdCard(currentMillis);        // ลองต่อ SD card ใหม่ถ้าเพิ่งเสียบ/หลุด

  // ---- ประเมินเตือน + ส่ง Sync ทุก 1 วินาที ----
  if (currentMillis - lastSyncBroadcastTime >= SYNC_INTERVAL_MS) {
    lastSyncBroadcastTime = currentMillis;
    evaluateClinicalAlerts();
    sdLogAlertChanges();               // รหัสเตือนเปลี่ยน -> บันทึกลงไฟล์เหตุการณ์
    broadcastSyncToNodes();
  }

  // ---- อัปเดตค่าที่คำนวณได้ทุก 2 วินาที ----
  if (currentMillis - lastCalcTime >= 2000) {
    hostBatteryVolts = readHostBattery();
    hostBatteryPct = calculateBatteryPct(hostBatteryVolts);

    portENTER_CRITICAL(&dataMux);
    for (int i = 0; i < MAX_SUPPORTED_STATIONS; i++) {
      stations[i].totalVolumeMl = (float)stations[i].totalDrops / (float)safeDropFactor(stations[i].cfg.dropFactor);
      if (!stations[i].isRunning || !isStationOnline(i)) {
        stations[i].flowRate_ml_hr = 0.0;
      }
    }
    portEXIT_CRITICAL(&dataMux);
    lastCalcTime = currentMillis;
  }

  // เลือกเตียงเองแล้วปล่อยไว้ครบเวลา -> กลับไปโหมดเลือกอัตโนมัติ
  if (manualFocusBed >= 0 && currentMillis > manualFocusUntil) {
    manualFocusBed = -1;
    uiNeedFramework = true;
  }

  // หรี่จอเมื่อไม่มีการใช้งาน และกลับมาสว่างเมื่อมีการแตะหรือกดปุ่ม
  if (!displaySleeping) {
    bool shouldDim = (currentMillis - lastUserActivityTime >= BACKLIGHT_DIM_MS) &&
                     !(globalAlarmTriggered && !isSnoozed()) && !anyNearEndPending();
    if (shouldDim != backlightDimmed) {
      backlightDimmed = shouldDim;
      setBacklightRaw(shouldDim ? BACKLIGHT_DIM_PCT : screenBrightness);
    }
  }

  unsigned long oledRefreshInterval = displaySleeping ? 1000 : 500;
  if (currentMillis - lastOledUpdateTime >= oledRefreshInterval) {
    updateHostDisplay();
    lastOledUpdateTime = currentMillis;
  }

  // ---- บันทึก Log รายนาที ----
  if (currentMillis - lastMinuteLogTime >= 60000) {
    globalMinuteCounter++;
    String currentTimestamp = getFormattedDateTime();

    for (int i = 0; i < activeStationCount; i++) {
      StationData &s = stations[i];

      portENTER_CRITICAL(&dataMux);
      uint32_t minuteDrops = s.dropsInCurrentMinute;
      s.dropsInCurrentMinute = 0;
      portEXIT_CRITICAL(&dataMux);

      uint8_t df = safeDropFactor(s.cfg.dropFactor);
      LogEntry entry;
      entry.minuteIndex = globalMinuteCounter;
      snprintf(entry.timeStr, sizeof(entry.timeStr), "%s", currentTimestamp.c_str());
      entry.drops = (minuteDrops > 65535) ? 65535 : (uint16_t)minuteDrops;
      entry.volume = s.totalVolumeMl;
      entry.rateHr = ((float)minuteDrops / (float)df) * 60.0f;   // mL/h จากหยดจริงใน 1 นาที
      entry.targetRate = s.cfg.targetRateHr;
      entry.alertCode = s.alertCode;
      entry.rssi = isStationOnline(i) ? s.rssi : 0;
      entry.battery = s.batteryVolts;

      if (s.logCount < MAX_LOGS) {
        s.logs[s.logCount++] = entry;
      } else {
        memmove(&s.logs[0], &s.logs[1], sizeof(LogEntry) * (MAX_LOGS - 1));
        s.logs[MAX_LOGS - 1] = entry;
      }
    }
    sdLogMinute(currentTimestamp);     // เขียนข้อมูลนาทีนี้ของทุกเตียงลง SD card
    lastMinuteLogTime += 60000;
  }
}
